[
  {
    "post_title": "Love, beauty and planet",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/tlyiu3/love_beauty_and_planet/",
    "score": 10,
    "author": "Anasuya28",
    "created_date": "2022-03-24 05:23:52",
    "num_comments": 31,
    "selftext": "Not skincare related but has anyone used love beauty and planet's shampoos? Did they work for you? \n\nI have been using their onion one for a few months and I like it. Also I was VERY surprised by the quantity. It's been 6 months and I still have so much left. It's great value for price imo.",
    "media_url": null
  },
  {
    "post_title": "What is happening to the Love Beauty And Planet products and even Find Your Happy Thing?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ah8qxq/what_is_happening_to_the_love_beauty_and_planet/",
    "score": 28,
    "author": "bluntprincess99",
    "created_date": "2024-02-02 17:12:25",
    "num_comments": 20,
    "selftext": "Why are so many of their products getting discontinued and why are they on 70 % sale on Nykaa? Is this a distress sale? Is HUL planning to discontinue both these brands in India?",
    "media_url": null
  },
  {
    "post_title": "Love Beauty and Planet",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/n9ow6a/love_beauty_and_planet/",
    "score": 13,
    "author": "marked-awk-4-awkward",
    "created_date": "2021-05-11 04:34:57",
    "num_comments": 11,
    "selftext": "Hi!\n\nHas anyone used the love beauty and planet products?\n\nAre they worth buying?\n\nThanks in advance!",
    "media_url": null
  },
  {
    "post_title": "I have been using love, beauty and planet shampoo for a while now! What are your thoughts on it?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/12rubfl/i_have_been_using_love_beauty_and_planet_shampoo/",
    "score": 11,
    "author": "whodafuckisthiss",
    "created_date": "2023-04-19 14:02:29",
    "num_comments": 15,
    "selftext": "What has your experience been like?",
    "media_url": null
  },
  {
    "post_title": "Love Beauty and Planet -Rice Water & Angelica Seed Oil Silicone Free Shampoo & Conditioner 400ml, Leave-In Conditioner 200ml",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1da7bhj/love_beauty_and_planet_rice_water_angelica_seed/",
    "score": 15,
    "author": "procrastinator_read",
    "created_date": "2024-06-07 10:25:03",
    "num_comments": 7,
    "selftext": "-About me: F/2b-3a frizzy and dry hair/humid conditions (live near the coastline)\n\nRoutine - Pre shampoo : Arata curly hair oil + coconut oil massage. \n\nother oils i have used in the past - soulflower rosemary lavendar oil,  castor oil, Avimee kesh kant hair oil. (It really didn’t matter what prepoo oil i used, just needed to soak my hair in oil)\nUsage time line - 3 months\n\n\nIngredients -  \nSHAMPOO : Water, Cocamidopropyl Betaine^, Sodium Methyl Cocoyl Taurate^, Perfume, Cocos Nucifera (Coconut) Oil^, Bacillus/ Rice ferment ltrate, Angelica Archangelica Seed Oil^, Stearamidopropyl Dimethylamine^, Polyquaternium-10, Citric Acid Monohydrate, Sodium Benzoate, Carbomer, Sodium Chloride, PPG-9, Disodium EDTA. ^Plant Based Ingredient\nCONDITIONER : Water, Cetearyl Alcohol^, Behentrimonium Chloride^ (and) Dipropylene Glycol, Cocos Nucifera (Coconut) Oil^, Perfume, Bacillus / Rice ferment ltrate^, Angelica Archangelica Seed Oil ^, Lactic Acid, Sodium Benzoate.\"\nOIL : Water, Cetearyl Alcohol^, VP/ Dimethylaminoethylmethacrylate Copolymer, Behentrimonium Chloride^ (and) Dipropylene Glycol, Stearamidopropyl Dimethylamine^, Polyquaternium-69, Perfume, Cocos Nucifera (Coconut) Oil^, Bacillus/ Rice ferment ltrate, Angelica Archangelica Seed Oil^, Lactic Acid, Phenoxyethanol, 1,2 hexanediol, Potassium Chloride, Disodium EDTA.\n\n• Consistency-\n\nshampoo -Transparent gel liquid \nConditioner- light soft cream\nLeave in - watery cream \n\n•\tSmell - floral notes, they claim to use fragrance sourced from Angelica Seed flower. \n\n• After application feel\nshampoo-  little to no lather, \nConditioner- No change in hair feel, Need a handful to feel the conditioner on my hair.\nLeave in - hair feels moist but no results seen until it hair air dries. \n\nExperience \nThe brand claims to be sustainable and organic and had a wide range of descriptions why they might be the best option for body and planet, wanted to test it out before binging out on their other products hence chose something i would definitely use on a 3 day basis. If there was a mildly disappointing hair range sub, i would put this one in it. It had so much potential to work as well as they claim especially seeing that it was just rice protein and oil based. \n\nShampoo - Mildly cleansing, if you are someone with dry scalp/use less oil then this would be ideal. I usually shampoo twice so this worked well for me. Smelt great, not for the sensitive nose ones, it’s extremely floral. I didn’t mind the fragrance it lasts a while. However for some it can cause itchy dry scalp, my partner didn’t like it. \nConditioner- not suitable for curly haired, wavy and straight haired maybe yes. Needed loads to condition and detangle my hair. Would take up so much time. And in curly hair girl terms “not enough slip” required for 3a curls. \nLeave in - i could say out of this range, this is only one that works for all hair types. Hair feels the moisture while scrunching and styling and soft after air drying  you still need a gel after this if you want to maintain the curls. \n\nOverall WNRP, tried this range as it was on discount otherwise it is too pricey for something which might not work on curly hair. I would give it points for the smell, sustainability and leave in conditioner. Wavy hair people , go for it and let me know if it helped. \n\nThank you! And let me know what next hair care i should review. ",
    "media_url": "https://preview.redd.it/a2i0nzx7m45d1.jpeg?auto=webp&s=94ac265e28b48290fa1d6f73e3cebb3a55ac5ec0"
  },
  {
    "post_title": "Haircare routine that changed my hair.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ccypgs/haircare_routine_that_changed_my_hair/",
    "score": 350,
    "author": "Fresh-Avacado-1",
    "created_date": "2024-04-25 18:32:09",
    "num_comments": 92,
    "selftext": "First ones are from today and the last two are from a year before.\n\nFor all the girlies, who have frizzy, thin and fine hair, and take selfies in a way to hide your hairline. I was literally that person soo, I wanna share my journey.\nHair type - 2a/2b, fine and thin hair. Oily scalp and dry ends, coloured hair.\n\nClimate- High humidity. \n\n1. **Pre- shampoo**  - I apply Virgin coconut oil, only on mids and ends, sectioning hair to ensure each strand is covered. Using coconut oil literally made my hair so soft and non- frizzy. I keep it on overnight.\n\n2. **Shampoo** - very essential.\n  a. Everyday shampoo- Schwarzkopf collagen volume boost shampoo, is by far my favorite and works best for fine thin hair, and makes my scalp clean and hair look voluminous. If you want that volume and have fine and thin hair, go for it. I use it every 4 days or so.\n\n b. Claryfying shampoo- I use the cipla 8x as I  have dandruff, like once every 2 weeks and also Dove anti dandruff shampoo.\n\n Mini review of shampoos I have used.\n\n 1. Love, beauty and planet- Does not do much for my hair as I have a very oily scalp, makes hair greasy the following day.WNRP\n\n2. Re'equil Hairfall control shampoo - is a good claryfying shampoo, but tends to be drying for my hair. WNRP.\n\n3. Loreal extraordinary clay- was very rough on my hair, made my hair fall like crazy in the shower, stopped using it after like 2 washes. WNRP.\n\n3. **Conditioner** - love my True Frog conditioner, favorite for my wavy hair, makes my hair very smooth, easy to wash off, and tames my frizzy hair.\n\nI use a hair mask every other wash, I love the matrix biolage hydrasource mask, the tub one. I keep it on for about 30 mins, and my hair looks amazing. Shiny, frizz-free and so so soft.\n\nAlso been using the Re'equil babasu conditioner, it's okay but I prefer the true frog conditioner .It conditions, but makes my hair look lifeless and flat.\n\n4. **Post- shampoo** - I use the Loreal extra ordinary oil for my ends and streax blue on my mids, on towel dried hair, Makes your hair look shiny and helps prevent dry hair.\n\nAlso use the Livon serum every night when I brush my hair followed by massaging my scalp for about 15 mins.\n \nThings that I think helped me the most.\n1. Massaging my scalp every night, putting oil on the ends.\n2. Being conscious of the products I use on my hair.\n3. Being gentle on my hair, while shampooing and also drying my hair.\n4. Using a silk pillowcase, keeps my hair looking amazing without the frizz and breakage.\n5. Eating greens and having a balanced diet.\n6. Doing yoga and strength training , has helped me with my stress which I feel like has helped my health be better and also my skin and hair.\n\nAlso I am no expert, so I am just presenting things that helped me and maybe can help you too.",
    "media_url": null
  },
  {
    "post_title": "What are your favourite variants from the love beauty and planet shampoos?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/18gqafk/what_are_your_favourite_variants_from_the_love/",
    "score": 2,
    "author": "jagsunasunalage",
    "created_date": "2023-12-12 16:47:27",
    "num_comments": 7,
    "selftext": "Same as the title",
    "media_url": null
  },
  {
    "post_title": "Asking for Love, beauty and planet hair mask review!",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/10ys3j5/asking_for_love_beauty_and_planet_hair_mask_review/",
    "score": 1,
    "author": "Serialprocastinator_",
    "created_date": "2023-02-10 13:32:45",
    "num_comments": 7,
    "selftext": "Has anybody used this hair mask? How was it? I am looking for deep conditioning mask for frizzy hair with smoothening properties. Please drop your recommendations!",
    "media_url": "https://preview.redd.it/5em6bpdfneha1.jpg?auto=webp&s=33edd8719c7ebf65d9242442595a0a6836753b64"
  },
  {
    "post_title": "Love Beauty Planet body lotion turned black",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/18pk9t9/love_beauty_planet_body_lotion_turned_black/",
    "score": 4,
    "author": "ragini95",
    "created_date": "2023-12-24 01:28:24",
    "num_comments": 13,
    "selftext": "I bought this LBP body lotion in argan and lavender some time ago, I hadn't used it. It was nearing expiry when I noticed it turned black like this at the bottom. Has this happened with anyone else? It smells fine and when I open the cap the moisturizer is still white inside. \n\nIt's expired now so it makes sense it would be ruined now. Just want to be clear it did happen before expiry and I was just lazy about posting/asking the brand. I've used their other products and everything's always been fine. \n\nCurious if anyone has had a similar experience?",
    "media_url": null
  },
  {
    "post_title": "Has anyone used the hair masks from Love beauty and planet?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/vk8ruw/has_anyone_used_the_hair_masks_from_love_beauty/",
    "score": 4,
    "author": "RealSkin04",
    "created_date": "2022-06-25 06:30:36",
    "num_comments": 1,
    "selftext": "Please share your reviews if you have🙏",
    "media_url": null
  },
  {
    "post_title": "Recently purchased OLAPLEX no3 had wonderful results with it. Now i am looking for a shampoo to go with it currenly use love beauty and planet lavender but it didn’t do anything to improve my hair. Any suggestions ?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ea4a3l/recently_purchased_olaplex_no3_had_wonderful/",
    "score": 0,
    "author": "Glittering-Bit-8369",
    "created_date": "2024-07-23 10:17:37",
    "num_comments": 9,
    "selftext": "My hair type is 2c to 3a\nI live in delhi and have hard-water problem also \n",
    "media_url": "https://preview.redd.it/ms2zawrtu8ed1.jpeg?auto=webp&s=063620abb9647e8350c6da569e35dbafb88ac47c"
  },
  {
    "post_title": "Love planet and beauty hair care",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/z2indu/love_planet_and_beauty_hair_care/",
    "score": 1,
    "author": "purplehearts_x",
    "created_date": "2022-11-23 07:27:32",
    "num_comments": 3,
    "selftext": "Been using Herbal Essence shampoo and conditioner for a while now, but want to switch to something sulpahte free. Is love planet and beauty worth the hype? Anyone who is been using it's argan oil or coconut water variant? Those are the ones I shortlisted",
    "media_url": null
  },
  {
    "post_title": "Has anyone tried 'Love Beauty & Planet' or 'Faith in Nature' haircare products?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/nw11g2/has_anyone_tried_love_beauty_planet_or_faith_in/",
    "score": 19,
    "author": "i_got_me_a_username",
    "created_date": "2021-06-09 17:14:25",
    "num_comments": 24,
    "selftext": "I'm considering buying a new Shampoo and Conditioner. Someone told me to post in this sub. Has anyone tried these brands?\n\nOr, are there any similar suggestions for dry, frizzy, low volume curly hair?",
    "media_url": null
  },
  {
    "post_title": "Petal fresh shampoo nd love beauty planet coconut water conditioner",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/jceu70/petal_fresh_shampoo_nd_love_beauty_planet_coconut/",
    "score": 9,
    "author": "No-Representative436",
    "created_date": "2020-10-16 18:03:24",
    "num_comments": 4,
    "selftext": "Hey there. I have just started going to gym. I am 21f.I am suffering from a lot of hairfall and dandruff. And I am thinking of switching to petal fresh rosemary shampoo and love beauty planet coconut water conditioner. Do, let me know if you have ny reviews about them. I have very coarse, freezy hair. And I use vaseegrahveda and coconut oil.",
    "media_url": null
  },
  {
    "post_title": "Skincare brands we vouch for.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/ypsudc/skincare_brands_we_vouch_for/",
    "score": 13,
    "author": "bluntprincess99",
    "created_date": "2022-11-08 17:29:43",
    "num_comments": 50,
    "selftext": "Loreal\nNivea\nFoxtale\nFixderma\nRivela\nThe Ordinary\nMinimalist\nCetaphil\nHyalugel\nBioderma\nSimple\nLove Beauty And Planet",
    "media_url": null
  },
  {
    "post_title": "Frizzy and Coarse Hairs",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1eetpkj/frizzy_and_coarse_hairs/",
    "score": 0,
    "author": "Emergency_Pipe1574",
    "created_date": "2024-07-29 07:42:18",
    "num_comments": 5,
    "selftext": "What products would you recommend for hairs like this\n\nI have tested lot of products such as\n\nLove Beauty and Planet \nDream Lengths\nBiolage\nMinimalistic Hair bond repair complex\n\nTried Lot of Home Remedies \n\nNothing seems to work\n\nI don't get it what's the problem here , used to have straight hairs before but one month suddenly 2 Years back all texture went away and hairs went wavy frizzy .\n\n\nHow do I improve the quality.\n\nPlease give your Inputs ",
    "media_url": null
  },
  {
    "post_title": "Need suggestions for shampoo ",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1eoq5jo/need_suggestions_for_shampoo/",
    "score": 1,
    "author": "MelodicAssistance170",
    "created_date": "2024-08-10 10:48:50",
    "num_comments": 2,
    "selftext": " I have fine thin hair, naturally straight & dry hair and oily scalp, this monsoon I have been facing scalp irritation and increased hairfall. I have been using L’Oréal Hyaluronic Acid Shampoo with love beauty and planet coconut conditioner. Want to switch shampoo, pls suggest recommendations for a good shampoo which provides volume and prevents hair thinning and another shampoo which could help with the scalp problem. Also any reviews on Arata Super Shampoo, Naturali Shampoos and Bare Anatomy range?",
    "media_url": null
  },
  {
    "post_title": "Best leave in conditioner for low porosity for 2b/3a hair",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ebma00/best_leave_in_conditioner_for_low_porosity_for/",
    "score": 2,
    "author": "smhh222",
    "created_date": "2024-07-25 04:44:37",
    "num_comments": 2,
    "selftext": "Hi which would be the best leave in conditioner for low porosity hair. Hair type 2b/3a dry frizzy hair.\n\nI was thinking \n• Love Beauty And Planet Rice Water & Angelica Seed Oil, or\n• Arata Advanced Curl Defining Cream All In One Leave-In Conditioner, or\n• TRue FRoG Leave-In Conditioner For Curly, Wavy, Dry And Frizzy Hair With Baobab Oil And Hibiscus Extracts\n\nOr anything in similar range.\n\nI am looking for something that would tame the friz, not necessarily something that would define the curls.\n\nAlso I henna my hair periodically to cover greys. Will it affect the efficiency of the leave in conditioner?",
    "media_url": null
  },
  {
    "post_title": "Is love beauty and earth purifying shampoo a good clarifying shampoo for oily dandruff scalp?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/10yq4wn/is_love_beauty_and_earth_purifying_shampoo_a_good/",
    "score": 2,
    "author": "Key-Abbreviations127",
    "created_date": "2023-02-10 11:56:11",
    "num_comments": 3,
    "selftext": "",
    "media_url": "https://preview.redd.it/zanh20576eha1.jpg?auto=webp&s=62a447448d56e0358fc5265475017828ecaf1d77"
  },
  {
    "post_title": "Haircare routine that worked for me wonderfully",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1cnng5j/haircare_routine_that_worked_for_me_wonderfully/",
    "score": 11,
    "author": "Albema8",
    "created_date": "2024-05-09 03:20:10",
    "num_comments": 5,
    "selftext": "My alternative routine for Loreal Clay Shampoo\n\nHi, I have oily and acne-prone facial skin and oily scalp. I used to use Loreal Clay Shampoo and I thought it's okay. But after it is discontinued, I found out how well it used to work. It used to keep oiliness away for atleast 3 days. Clear scalp also means that my face is clear as well. For oily skin folks, scalp and face are related. \n\nI started using several other shampoos and almost all of them made my face oilier. After spending a ton looking for alternatives, I found out a solution which works for me.\n\nWhat worked for me is I shampoo with a basic SLES based shampoo 2 or 3 times (depending on how oily my scalp is) and in the last wash I use [LOVE BEAUTY AND PLANET TEA TREE SCALP PURIFY SULFATE FREE SHAMPOO](https://www.nykaa.com/love-beauty-planet-tea-tree-peppermint-vetiver-sulfate-free-purifying-shampoo/p/4586549). I'm a guy so just shampooing works. But if you have long hair you might have to additionally condition it from mid lengths to ends only.\n\nSo how do you select a basic shampoo? \n\na) It's important you select a SLES based shampoo because sulfate free shampoo can't cut the oiliness, especially for people with oily scalp.\n\nb) The shampoo should be \"basic\". Meaning just cleansing. Not damage repair or moisturising or hydrating or nourishing. Because while these shampoos cleanse, they simultaneously add moisturising stuff to scalp. The moisturising ingredients are good for hair but bad for oily scalp. They make scalp (and thus face) greasy faster.\n\nBASIC SHAMPOO EXAMPLE:\n\nSunsilk black shine shampoo\n\nLoreal hairfall shampoo (yet to try)\n\nI'm using Sunsilk shampoo. May be somebody else can suggest better examples.\n\nWith this routine I can easily achieve the oil free 3 days just like before. Hope this post helped you. So which routine/products helped you?",
    "media_url": "https://external-preview.redd.it/7mjXRtm4IRGMNwVlyW2nxi6gUNGhwVfzQEJSBYHC75I.jpg?auto=webp&s=e8e30fe60f77642b5dd75e5f82bd5058a219f246"
  },
  {
    "post_title": "Shampoo recommendation",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ee4m2v/shampoo_recommendation/",
    "score": 1,
    "author": "kingsizebutt",
    "created_date": "2024-07-28 10:42:24",
    "num_comments": 6,
    "selftext": "Hair type - 2B, fine and frizzy\nI used love and beauty planet and tho it's good, it doesn't do much to clean the scalp since it's sulphate free. I was thinking about switching to a better brand shampoo (not too exorbitant). Main concern would be too maintain frizz and give a voluminous finish to my wavy hair",
    "media_url": null
  },
  {
    "post_title": "Here’s a thought. I get really frustated when I see Brands in-house German drug Store Brands being sold at such a high price in India.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/vu42hp/heres_a_thought_i_get_really_frustated_when_i_see/",
    "score": 19,
    "author": "3den0208",
    "created_date": "2022-07-08 06:27:27",
    "num_comments": 18,
    "selftext": " I’m talking about brands like Isana, Balaea and Love, Beauty and Planet.\nWhat more great affordable German brands like Lavera and Sante are missing. \nI need them in India",
    "media_url": null
  },
  {
    "post_title": "Fascinated by good brands being bought by huge conglomerates",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1bzms3e/fascinated_by_good_brands_being_bought_by_huge/",
    "score": 102,
    "author": "MeForMeera",
    "created_date": "2024-04-09 08:09:32",
    "num_comments": 21,
    "selftext": "I was watching a video by a YouTube channel called '[underskin](https://youtu.be/fYYQYDlqRZ0?si=cJh8TBXsDDPeBn4H)' where they talked about ***The Body*** ***Shop*** and how it went downhill after it was acquired by *L'Oreal*.\n\nThis got me thinking about all the good brands that we use that we might not even be aware are owned by huge companies. Most obvious example to me is ***CeraVe*** which I was shocked to find was owned by *L'Oreal*. ***Simple*** and ***Love, Beauty & Planet*** is owned by *Unilever*. \n\nOther Indian examples would be *Mamaearth* owning a bunch of brands like ***TheDermaCo***, ***Dr Sheth's***, ***Aqualogica***. *Nykaa* recently acquired ***Dot & Key***. Not skincare related but the healthy food brand *YogaBar* was sold to ITC.\n\nIt fascinates me how small brands that we primarily buy from cause of trusting their ingredients, end up getting bought out by brands we avoid. Do these brands continue having autonomy on selecting ingredients? Do they have freedom on major decisions? \n\nIt is kind of discouraging that brands that we love have high chances of being sold off once they reach their peak. ",
    "media_url": "https://external-preview.redd.it/txQB84NJ_dClsA0VWWl0VC6q28gBBCKXc64kn3O4hnA.jpg?auto=webp&s=c4452754b970d958e49dbb2c7893fd3033f9c1de"
  },
  {
    "post_title": "Routine and products for wavy hair?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1e8lifk/routine_and_products_for_wavy_hair/",
    "score": 1,
    "author": "clumsy-af28",
    "created_date": "2024-07-21 12:45:29",
    "num_comments": 2,
    "selftext": "Hi , \nI have been reading posts on this sub but couldn’t find a full routine anywhere hence posting here. \n\nI have wavy hair mostly from bottom (havent tried cgm yet) , medium to low porosity (not sure), and not very dense. My hair are also frizzy without styling. I also have oily scalp mainly in monsoon. \n\nI had done smoothening once and for longest time have used straightner for styling. (Have stopped from a month)\n\nI want to start cgm for my waves , and in general have stronger denser hair. \n\nBut I am very confused reading everything still on \nA) what routine i should follow\nB) what products I should get for each part of routine. (This is where I am too confused)\n\nAs of now I just use love beauty planet argan oil shampoo. \n\nPlease help me out!!!",
    "media_url": null
  },
  {
    "post_title": "Has anyone experienced increased hairfall with fixmycurls products?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/172uc4g/has_anyone_experienced_increased_hairfall_with/",
    "score": 0,
    "author": "tytywho",
    "created_date": "2023-10-08 08:50:10",
    "num_comments": 3,
    "selftext": "Hi I (F26) recently went to a dermatologist who diagnosed me with female pattern hairloss stage 2 and prescribed minoxidil. I really don't want to deal with the dread shed and the side effects of minoxidil so I read up on Rosemary oil. I decided to try out fixmycurls for my curly hair (cleansing shampoo, everyday moisturizing shampoo and hydrating conditioner followed by Loreal Paris serum is the routine I'm following) because I saw the cleansing shampoo has Rosemary oil in it and I had heard good reviews about this brand. But I feel like everytime I wash my hair I'm losing more hair, not in clumps but still more than before ( I was using love beauty and planet before and honestly it was so good). I'm scared of losing more hair. I know probably minoxidil will help but I'm so scared of the dread shed. Does Rosemary oil also have a dread shed? Should I stop using this brand? Can anyone please suggest me what to do?",
    "media_url": null
  },
  {
    "post_title": "Need advice for newly coloured hair",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/177jf0h/need_advice_for_newly_coloured_hair/",
    "score": 3,
    "author": "man_v2004",
    "created_date": "2023-10-14 06:46:02",
    "num_comments": 0,
    "selftext": "As the title says, I've recently coloured my hair for the first time. It's a mix of browns, so I didn't need to lighten my hair or anything. I was advised by my hair stylist to use mild, SLS free shampoo. I've been using Love, Beauty and Planet products for a while so that's not a problem, but I'm unsure about whether or not I can use other products, namely TO Multi Peptide Serum and Juicy Chemistry hair masks. I normally apply the peptide serum once a week and the JC mask once in two weeks.\n\nI have an oily scalp and fine, mostly straight hair (I might be 1A or 1B, not sure yet and still learning these terms!). I also have the charcoal scalp cleansing mask from Briogeo which I don't apply very frequently, but is excellent at keeping my scalp clean and healthy. I want to be able to use this too. \n\nAny advice on what I can and cannot use would be very helpful! Thanks in advance!",
    "media_url": null
  },
  {
    "post_title": "Hair product recommendations for itchy scalp.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/usi0wl/hair_product_recommendations_for_itchy_scalp/",
    "score": 6,
    "author": "evanapradhan",
    "created_date": "2022-05-18 17:23:41",
    "num_comments": 8,
    "selftext": "So my hair is moderately thick, wavy and lately it’s been kinda dry and frizzy, but at the same time my scalp gets oily and itchy a day and a half after a bath (if that makes sense) so I need to shower every alternate day for relief. \n\nMy main problem rn is with the itchy scalp and my current routine is just love beauty and planet shampoo and conditioner (I was using himalaya for years but switched to this about a month ago) and no heat styling whatsoever. \n\nI scrolled all the way to the bottom looking for posts relating to itchy scalps so I figured I’d ask. Any hair products like oils, shampoos, conditioners etc would be really helpful thanks.",
    "media_url": null
  },
  {
    "post_title": "Hair product recommendation needed please!!",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/17dkwwh/hair_product_recommendation_needed_please/",
    "score": 1,
    "author": "dindjarinthisdway",
    "created_date": "2023-10-22 04:14:49",
    "num_comments": 1,
    "selftext": "Hair type: Oily scalp, frizzy hair \nClimate : Hot and humid (even in winters\nAge: Early 20s ( I don't have pcod/pcos/thyroid related issues)\nHair concern: my hair is frizzy very frizzy. I am very new to this haircare thing and i use love beauty planet shampoo. I use loreal hyaluron range too. Please suggest a hair treatment and or mask to repair this. Any suggestions as well!! \nAlso is minimalist hair growth serum good?? Been facing hair thinning in the front partition line.",
    "media_url": null
  },
  {
    "post_title": "Hair care reviews for frizzy hair!",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/13cgwi5/hair_care_reviews_for_frizzy_hair/",
    "score": 93,
    "author": "Efficient-Second-618",
    "created_date": "2023-05-09 05:48:19",
    "num_comments": 68,
    "selftext": "Hello everyone! I never thought I would review any products myself but I’ve ended up with a routine that has significantly worked for me and I don’t want to gatekeep! I’m not comfortable sharing before after pics but all I can say is I’ve spent yearsss trying oils and shampoos and I finally feel like these products have made my hair soft, manageable and presentable at least! 😭 ❤️ and it’s a fairly simple routine that I’ve developed for someone who sucks at dedicating time to take care of themselves (I’m 26 sheeesh)!\n\n&#x200B;\n\n**Hair type:** 2B fine hair, low density, low porosity\n\n**Climate:** Mumbai (mostly humid)\n\n**Usage timeline:** more than a month\n\n&#x200B;\n\n**Soulflower Rosemary Essential Oil with Coconut Carrier Oil -** I think this part of the process is making the most difference. I’ve started with adding a few drops of rosemary oil to the coconut only once a week for now cause I’ve heard rosemary is potent. I wash my hair every alternate day and I’ve been overnight oiling (just coconut) before every wash. If I’m adding rosemary I don’t necessarily do it overnight as an hour feels enough.\n\nSide note; this is the only brand I’ve tried for the rosemary oil so I’m not sure if it’s the best one. I’m yet to see it’s effects on the hair growth part.\n\n**Love Beauty & Planet Argan Oil and Lavender Shampoo -** my shampoo journey deserves a whole different thread probably but to cut it short; I tried the L’Oréal HA shampoo which was wonderful for hydration but made my scalp itchy like hell. Never before had a product reacted in such a conflicted way. But this!!! I read many positive reviews of the LBP one and saw it in many girls houses. Finally tried it and can confirm the hype. It makes the hair frizz free AND bouncy and smell like a lavender field, also minimal hair loss while shampooing.\n\n**Re’equil Babassu Anti Frizz & Smoothening Conditioner -** I use this on days I’m not able to oil and it’s worked like a charm. It’s super creamy so applies well on the hair, doesn’t buildup and does what it says. A little is a lot.\n\n**IHA Restoring Hair Serum -** **HG -** I chanced upon trying this because it was gifted to me; but it’s probably the most magical product from the list. If you apply it on towel damp hair it just detangles so smoothly without breaking, and locks in the hydration at the same time. Do not use it on dry hair as it’ll become lumpy.\n\n&#x200B;\n\nHope this helps, would love to discuss further!\n\nCheers!",
    "media_url": null
  },
  {
    "post_title": "Suggest a shampoo which literally cleans everything off my hair.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/130e6ng/suggest_a_shampoo_which_literally_cleans/",
    "score": 35,
    "author": "Just_Getting-by",
    "created_date": "2023-04-27 08:26:09",
    "num_comments": 75,
    "selftext": "Hi, can you suggest me a shampoo which removes everything (oil, silicones, old fragrance, etc) off my hairs, and doesn't leave any silicones, fragrance, nothing after washing away.\n\nSulphates, without sulphates, anything that works.\n\nI want to clean with such a shamoo, and then apply hair conditioner according to my hairs.\n\n___\n\nIf you think something is wrong with this method, please tell.\n\n___\n\nThanks for the suggestions everyone.\n\nSuggestions so far: {my comment} \n* Sunsilk Pink:  has silicones, also mica+Titanium Dioxide, which stays on hair after wash.\n*  Herbal Essences mint strawberry: has Conditioning agents in it, which forms a layer.\n* L'oreal extraordinary clay: has silicones and mica, which among other things remains on hair after wash.\n* * **Pantene lively clean**: Pretty close to what I am looking for. It has only one conditioning agent pentenyl ethyl ether, which is helpful/good, and mild fragrances.\n* Scalp Pro: has several ingredient which form film on hairs\n* Salon Shampoo: We don't know what do they have.\n* * **Faith in Nature** (you can consider if you don't have oily hair): Don't leave anything on hair other than glycerin, but is mild on cleaning.\n* L'oreal Dream Lengths: has silicones, mica, conditioning agents which stay on hair even after washing.\n* Love Beauty & Planet Apple Cider Vinegar: has silicones, among other things which stay on hair.\n* Arata Shampoo: has hydrators/emollients which form film on hair. (OT comment- it has several essential oils in 0.3% and lesser concentrations, as low as 0.025%, which won't give any observable results, if any.)\n* Re'equil Shampoo: has several film forming agents.\n* L'oreal Professional Instant Clear (Scalp Advanced Anti Dandruff): It do have multiple film forming agents.\n* Anomaly Clarifying Shampoo: Have multiple ingredients which stay after wash.\n* * **The ordinary shampoo**: Exactly what I was looking for, but expensive for me, so will have to do with Lively Clean.\n\nBold are either exactly or close to what I was looking for.\n\nbtw I am not some specialist, I read ingredients and search about them online. If you find something wrong please tell me.\n\n(All relevant suggestions added, as on 27 September 2023)",
    "media_url": null
  }
]