[
  {
    "post_title": "Love, beauty and planet",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/tlyiu3/love_beauty_and_planet/",
    "score": 10,
    "author": "Anasuya28",
    "created_date": "2022-03-24 05:23:52",
    "num_comments": 31,
    "selftext": "Not skincare related but has anyone used love beauty and planet's shampoos? Did they work for you? \n\nI have been using their onion one for a few months and I like it. Also I was VERY surprised by the quantity. It's been 6 months and I still have so much left. It's great value for price imo."
  },
  {
    "post_title": "What is happening to the Love Beauty And Planet products and even Find Your Happy Thing?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ah8qxq/what_is_happening_to_the_love_beauty_and_planet/",
    "score": 28,
    "author": "bluntprincess99",
    "created_date": "2024-02-02 17:12:25",
    "num_comments": 20,
    "selftext": "Why are so many of their products getting discontinued and why are they on 70 % sale on Nykaa? Is this a distress sale? Is HUL planning to discontinue both these brands in India?"
  },
  {
    "post_title": "Love Beauty and Planet",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/n9ow6a/love_beauty_and_planet/",
    "score": 12,
    "author": "marked-awk-4-awkward",
    "created_date": "2021-05-11 04:34:57",
    "num_comments": 11,
    "selftext": "Hi!\n\nHas anyone used the love beauty and planet products?\n\nAre they worth buying?\n\nThanks in advance!"
  },
  {
    "post_title": "I have been using love, beauty and planet shampoo for a while now! What are your thoughts on it?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/12rubfl/i_have_been_using_love_beauty_and_planet_shampoo/",
    "score": 11,
    "author": "whodafuckisthiss",
    "created_date": "2023-04-19 14:02:29",
    "num_comments": 15,
    "selftext": "What has your experience been like?"
  },
  {
    "post_title": "Love Beauty and Planet -Rice Water & Angelica Seed Oil Silicone Free Shampoo & Conditioner 400ml, Leave-In Conditioner 200ml",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1da7bhj/love_beauty_and_planet_rice_water_angelica_seed/",
    "score": 14,
    "author": "procrastinator_read",
    "created_date": "2024-06-07 10:25:03",
    "num_comments": 7,
    "selftext": "-About me: F/2b-3a frizzy and dry hair/humid conditions (live near the coastline)\n\nRoutine - Pre shampoo : Arata curly hair oil + coconut oil massage. \n\nother oils i have used in the past - soulflower rosemary lavendar oil,  castor oil, Avimee kesh kant hair oil. (It really didn’t matter what prepoo oil i used, just needed to soak my hair in oil)\nUsage time line - 3 months\n\n\nIngredients -  \nSHAMPOO : Water, Cocamidopropyl Betaine^, Sodium Methyl Cocoyl Taurate^, Perfume, Cocos Nucifera (Coconut) Oil^, Bacillus/ Rice ferment ltrate, Angelica Archangelica Seed Oil^, Stearamidopropyl Dimethylamine^, Polyquaternium-10, Citric Acid Monohydrate, Sodium Benzoate, Carbomer, Sodium Chloride, PPG-9, Disodium EDTA. ^Plant Based Ingredient\nCONDITIONER : Water, Cetearyl Alcohol^, Behentrimonium Chloride^ (and) Dipropylene Glycol, Cocos Nucifera (Coconut) Oil^, Perfume, Bacillus / Rice ferment ltrate^, Angelica Archangelica Seed Oil ^, Lactic Acid, Sodium Benzoate.\"\nOIL : Water, Cetearyl Alcohol^, VP/ Dimethylaminoethylmethacrylate Copolymer, Behentrimonium Chloride^ (and) Dipropylene Glycol, Stearamidopropyl Dimethylamine^, Polyquaternium-69, Perfume, Cocos Nucifera (Coconut) Oil^, Bacillus/ Rice ferment ltrate, Angelica Archangelica Seed Oil^, Lactic Acid, Phenoxyethanol, 1,2 hexanediol, Potassium Chloride, Disodium EDTA.\n\n• Consistency-\n\nshampoo -Transparent gel liquid \nConditioner- light soft cream\nLeave in - watery cream \n\n•\tSmell - floral notes, they claim to use fragrance sourced from Angelica Seed flower. \n\n• After application feel\nshampoo-  little to no lather, \nConditioner- No change in hair feel, Need a handful to feel the conditioner on my hair.\nLeave in - hair feels moist but no results seen until it hair air dries. \n\nExperience \nThe brand claims to be sustainable and organic and had a wide range of descriptions why they might be the best option for body and planet, wanted to test it out before binging out on their other products hence chose something i would definitely use on a 3 day basis. If there was a mildly disappointing hair range sub, i would put this one in it. It had so much potential to work as well as they claim especially seeing that it was just rice protein and oil based. \n\nShampoo - Mildly cleansing, if you are someone with dry scalp/use less oil then this would be ideal. I usually shampoo twice so this worked well for me. Smelt great, not for the sensitive nose ones, it’s extremely floral. I didn’t mind the fragrance it lasts a while. However for some it can cause itchy dry scalp, my partner didn’t like it. \nConditioner- not suitable for curly haired, wavy and straight haired maybe yes. Needed loads to condition and detangle my hair. Would take up so much time. And in curly hair girl terms “not enough slip” required for 3a curls. \nLeave in - i could say out of this range, this is only one that works for all hair types. Hair feels the moisture while scrunching and styling and soft after air drying  you still need a gel after this if you want to maintain the curls. \n\nOverall WNRP, tried this range as it was on discount otherwise it is too pricey for something which might not work on curly hair. I would give it points for the smell, sustainability and leave in conditioner. Wavy hair people , go for it and let me know if it helped. \n\nThank you! And let me know what next hair care i should review. "
  },
  {
    "post_title": "Haircare routine that changed my hair.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ccypgs/haircare_routine_that_changed_my_hair/",
    "score": 352,
    "author": "Fresh-Avacado-1",
    "created_date": "2024-04-25 18:32:09",
    "num_comments": 92,
    "selftext": "First ones are from today and the last two are from a year before.\n\nFor all the girlies, who have frizzy, thin and fine hair, and take selfies in a way to hide your hairline. I was literally that person soo, I wanna share my journey.\nHair type - 2a/2b, fine and thin hair. Oily scalp and dry ends, coloured hair.\n\nClimate- High humidity. \n\n1. **Pre- shampoo**  - I apply Virgin coconut oil, only on mids and ends, sectioning hair to ensure each strand is covered. Using coconut oil literally made my hair so soft and non- frizzy. I keep it on overnight.\n\n2. **Shampoo** - very essential.\n  a. Everyday shampoo- Schwarzkopf collagen volume boost shampoo, is by far my favorite and works best for fine thin hair, and makes my scalp clean and hair look voluminous. If you want that volume and have fine and thin hair, go for it. I use it every 4 days or so.\n\n b. Claryfying shampoo- I use the cipla 8x as I  have dandruff, like once every 2 weeks and also Dove anti dandruff shampoo.\n\n Mini review of shampoos I have used.\n\n 1. Love, beauty and planet- Does not do much for my hair as I have a very oily scalp, makes hair greasy the following day.WNRP\n\n2. Re'equil Hairfall control shampoo - is a good claryfying shampoo, but tends to be drying for my hair. WNRP.\n\n3. Loreal extraordinary clay- was very rough on my hair, made my hair fall like crazy in the shower, stopped using it after like 2 washes. WNRP.\n\n3. **Conditioner** - love my True Frog conditioner, favorite for my wavy hair, makes my hair very smooth, easy to wash off, and tames my frizzy hair.\n\nI use a hair mask every other wash, I love the matrix biolage hydrasource mask, the tub one. I keep it on for about 30 mins, and my hair looks amazing. Shiny, frizz-free and so so soft.\n\nAlso been using the Re'equil babasu conditioner, it's okay but I prefer the true frog conditioner .It conditions, but makes my hair look lifeless and flat.\n\n4. **Post- shampoo** - I use the Loreal extra ordinary oil for my ends and streax blue on my mids, on towel dried hair, Makes your hair look shiny and helps prevent dry hair.\n\nAlso use the Livon serum every night when I brush my hair followed by massaging my scalp for about 15 mins.\n \nThings that I think helped me the most.\n1. Massaging my scalp every night, putting oil on the ends.\n2. Being conscious of the products I use on my hair.\n3. Being gentle on my hair, while shampooing and also drying my hair.\n4. Using a silk pillowcase, keeps my hair looking amazing without the frizz and breakage.\n5. Eating greens and having a balanced diet.\n6. Doing yoga and strength training , has helped me with my stress which I feel like has helped my health be better and also my skin and hair.\n\nAlso I am no expert, so I am just presenting things that helped me and maybe can help you too."
  },
  {
    "post_title": "What are your favourite variants from the love beauty and planet shampoos?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/18gqafk/what_are_your_favourite_variants_from_the_love/",
    "score": 2,
    "author": "jagsunasunalage",
    "created_date": "2023-12-12 16:47:27",
    "num_comments": 7,
    "selftext": "Same as the title"
  },
  {
    "post_title": "Asking for Love, beauty and planet hair mask review!",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/10ys3j5/asking_for_love_beauty_and_planet_hair_mask_review/",
    "score": 1,
    "author": "Serialprocastinator_",
    "created_date": "2023-02-10 13:32:45",
    "num_comments": 7,
    "selftext": "Has anybody used this hair mask? How was it? I am looking for deep conditioning mask for frizzy hair with smoothening properties. Please drop your recommendations!"
  },
  {
    "post_title": "Love Beauty Planet body lotion turned black",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/18pk9t9/love_beauty_planet_body_lotion_turned_black/",
    "score": 4,
    "author": "ragini95",
    "created_date": "2023-12-24 01:28:24",
    "num_comments": 13,
    "selftext": "I bought this LBP body lotion in argan and lavender some time ago, I hadn't used it. It was nearing expiry when I noticed it turned black like this at the bottom. Has this happened with anyone else? It smells fine and when I open the cap the moisturizer is still white inside. \n\nIt's expired now so it makes sense it would be ruined now. Just want to be clear it did happen before expiry and I was just lazy about posting/asking the brand. I've used their other products and everything's always been fine. \n\nCurious if anyone has had a similar experience?"
  },
  {
    "post_title": "Has anyone used the hair masks from Love beauty and planet?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/vk8ruw/has_anyone_used_the_hair_masks_from_love_beauty/",
    "score": 5,
    "author": "RealSkin04",
    "created_date": "2022-06-25 06:30:36",
    "num_comments": 1,
    "selftext": "Please share your reviews if you have🙏"
  },
  {
    "post_title": "Recently purchased OLAPLEX no3 had wonderful results with it. Now i am looking for a shampoo to go with it currenly use love beauty and planet lavender but it didn’t do anything to improve my hair. Any suggestions ?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ea4a3l/recently_purchased_olaplex_no3_had_wonderful/",
    "score": 0,
    "author": "Glittering-Bit-8369",
    "created_date": "2024-07-23 10:17:37",
    "num_comments": 9,
    "selftext": "My hair type is 2c to 3a\nI live in delhi and have hard-water problem also \n"
  },
  {
    "post_title": "Love planet and beauty hair care",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/z2indu/love_planet_and_beauty_hair_care/",
    "score": 1,
    "author": "purplehearts_x",
    "created_date": "2022-11-23 07:27:32",
    "num_comments": 3,
    "selftext": "Been using Herbal Essence shampoo and conditioner for a while now, but want to switch to something sulpahte free. Is love planet and beauty worth the hype? Anyone who is been using it's argan oil or coconut water variant? Those are the ones I shortlisted"
  },
  {
    "post_title": "Has anyone tried 'Love Beauty & Planet' or 'Faith in Nature' haircare products?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/nw11g2/has_anyone_tried_love_beauty_planet_or_faith_in/",
    "score": 19,
    "author": "i_got_me_a_username",
    "created_date": "2021-06-09 17:14:25",
    "num_comments": 24,
    "selftext": "I'm considering buying a new Shampoo and Conditioner. Someone told me to post in this sub. Has anyone tried these brands?\n\nOr, are there any similar suggestions for dry, frizzy, low volume curly hair?"
  },
  {
    "post_title": "Petal fresh shampoo nd love beauty planet coconut water conditioner",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/jceu70/petal_fresh_shampoo_nd_love_beauty_planet_coconut/",
    "score": 8,
    "author": "No-Representative436",
    "created_date": "2020-10-16 18:03:24",
    "num_comments": 4,
    "selftext": "Hey there. I have just started going to gym. I am 21f.I am suffering from a lot of hairfall and dandruff. And I am thinking of switching to petal fresh rosemary shampoo and love beauty planet coconut water conditioner. Do, let me know if you have ny reviews about them. I have very coarse, freezy hair. And I use vaseegrahveda and coconut oil."
  },
  {
    "post_title": "Skincare brands we vouch for.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/ypsudc/skincare_brands_we_vouch_for/",
    "score": 12,
    "author": "bluntprincess99",
    "created_date": "2022-11-08 17:29:43",
    "num_comments": 50,
    "selftext": "Loreal\nNivea\nFoxtale\nFixderma\nRivela\nThe Ordinary\nMinimalist\nCetaphil\nHyalugel\nBioderma\nSimple\nLove Beauty And Planet"
  },
  {
    "post_title": "Need suggestions for shampoo ",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1eoq5jo/need_suggestions_for_shampoo/",
    "score": 1,
    "author": "MelodicAssistance170",
    "created_date": "2024-08-10 10:48:50",
    "num_comments": 2,
    "selftext": " I have fine thin hair, naturally straight & dry hair and oily scalp, this monsoon I have been facing scalp irritation and increased hairfall. I have been using L’Oréal Hyaluronic Acid Shampoo with love beauty and planet coconut conditioner. Want to switch shampoo, pls suggest recommendations for a good shampoo which provides volume and prevents hair thinning and another shampoo which could help with the scalp problem. Also any reviews on Arata Super Shampoo, Naturali Shampoos and Bare Anatomy range?"
  },
  {
    "post_title": "Frizzy and Coarse Hairs",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1eetpkj/frizzy_and_coarse_hairs/",
    "score": 0,
    "author": "Emergency_Pipe1574",
    "created_date": "2024-07-29 07:42:18",
    "num_comments": 5,
    "selftext": "What products would you recommend for hairs like this\n\nI have tested lot of products such as\n\nLove Beauty and Planet \nDream Lengths\nBiolage\nMinimalistic Hair bond repair complex\n\nTried Lot of Home Remedies \n\nNothing seems to work\n\nI don't get it what's the problem here , used to have straight hairs before but one month suddenly 2 Years back all texture went away and hairs went wavy frizzy .\n\n\nHow do I improve the quality.\n\nPlease give your Inputs "
  },
  {
    "post_title": "Best leave in conditioner for low porosity for 2b/3a hair",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ebma00/best_leave_in_conditioner_for_low_porosity_for/",
    "score": 2,
    "author": "smhh222",
    "created_date": "2024-07-25 04:44:37",
    "num_comments": 2,
    "selftext": "Hi which would be the best leave in conditioner for low porosity hair. Hair type 2b/3a dry frizzy hair.\n\nI was thinking \n• Love Beauty And Planet Rice Water & Angelica Seed Oil, or\n• Arata Advanced Curl Defining Cream All In One Leave-In Conditioner, or\n• TRue FRoG Leave-In Conditioner For Curly, Wavy, Dry And Frizzy Hair With Baobab Oil And Hibiscus Extracts\n\nOr anything in similar range.\n\nI am looking for something that would tame the friz, not necessarily something that would define the curls.\n\nAlso I henna my hair periodically to cover greys. Will it affect the efficiency of the leave in conditioner?"
  },
  {
    "post_title": "Is love beauty and earth purifying shampoo a good clarifying shampoo for oily dandruff scalp?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/10yq4wn/is_love_beauty_and_earth_purifying_shampoo_a_good/",
    "score": 2,
    "author": "Key-Abbreviations127",
    "created_date": "2023-02-10 11:56:11",
    "num_comments": 3,
    "selftext": ""
  },
  {
    "post_title": "Haircare routine that worked for me wonderfully",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1cnng5j/haircare_routine_that_worked_for_me_wonderfully/",
    "score": 11,
    "author": "Albema8",
    "created_date": "2024-05-09 03:20:10",
    "num_comments": 5,
    "selftext": "My alternative routine for Loreal Clay Shampoo\n\nHi, I have oily and acne-prone facial skin and oily scalp. I used to use Loreal Clay Shampoo and I thought it's okay. But after it is discontinued, I found out how well it used to work. It used to keep oiliness away for atleast 3 days. Clear scalp also means that my face is clear as well. For oily skin folks, scalp and face are related. \n\nI started using several other shampoos and almost all of them made my face oilier. After spending a ton looking for alternatives, I found out a solution which works for me.\n\nWhat worked for me is I shampoo with a basic SLES based shampoo 2 or 3 times (depending on how oily my scalp is) and in the last wash I use [LOVE BEAUTY AND PLANET TEA TREE SCALP PURIFY SULFATE FREE SHAMPOO](https://www.nykaa.com/love-beauty-planet-tea-tree-peppermint-vetiver-sulfate-free-purifying-shampoo/p/4586549). I'm a guy so just shampooing works. But if you have long hair you might have to additionally condition it from mid lengths to ends only.\n\nSo how do you select a basic shampoo? \n\na) It's important you select a SLES based shampoo because sulfate free shampoo can't cut the oiliness, especially for people with oily scalp.\n\nb) The shampoo should be \"basic\". Meaning just cleansing. Not damage repair or moisturising or hydrating or nourishing. Because while these shampoos cleanse, they simultaneously add moisturising stuff to scalp. The moisturising ingredients are good for hair but bad for oily scalp. They make scalp (and thus face) greasy faster.\n\nBASIC SHAMPOO EXAMPLE:\n\nSunsilk black shine shampoo\n\nLoreal hairfall shampoo (yet to try)\n\nI'm using Sunsilk shampoo. May be somebody else can suggest better examples.\n\nWith this routine I can easily achieve the oil free 3 days just like before. Hope this post helped you. So which routine/products helped you?"
  },
  {
    "post_title": "Shampoo recommendation",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ee4m2v/shampoo_recommendation/",
    "score": 1,
    "author": "kingsizebutt",
    "created_date": "2024-07-28 10:42:24",
    "num_comments": 6,
    "selftext": "Hair type - 2B, fine and frizzy\nI used love and beauty planet and tho it's good, it doesn't do much to clean the scalp since it's sulphate free. I was thinking about switching to a better brand shampoo (not too exorbitant). Main concern would be too maintain frizz and give a voluminous finish to my wavy hair"
  },
  {
    "post_title": "Here’s a thought. I get really frustated when I see Brands in-house German drug Store Brands being sold at such a high price in India.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/vu42hp/heres_a_thought_i_get_really_frustated_when_i_see/",
    "score": 19,
    "author": "3den0208",
    "created_date": "2022-07-08 06:27:27",
    "num_comments": 18,
    "selftext": " I’m talking about brands like Isana, Balaea and Love, Beauty and Planet.\nWhat more great affordable German brands like Lavera and Sante are missing. \nI need them in India"
  },
  {
    "post_title": "Fascinated by good brands being bought by huge conglomerates",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1bzms3e/fascinated_by_good_brands_being_bought_by_huge/",
    "score": 106,
    "author": "MeForMeera",
    "created_date": "2024-04-09 08:09:32",
    "num_comments": 21,
    "selftext": "I was watching a video by a YouTube channel called '[underskin](https://youtu.be/fYYQYDlqRZ0?si=cJh8TBXsDDPeBn4H)' where they talked about ***The Body*** ***Shop*** and how it went downhill after it was acquired by *L'Oreal*.\n\nThis got me thinking about all the good brands that we use that we might not even be aware are owned by huge companies. Most obvious example to me is ***CeraVe*** which I was shocked to find was owned by *L'Oreal*. ***Simple*** and ***Love, Beauty & Planet*** is owned by *Unilever*. \n\nOther Indian examples would be *Mamaearth* owning a bunch of brands like ***TheDermaCo***, ***Dr Sheth's***, ***Aqualogica***. *Nykaa* recently acquired ***Dot & Key***. Not skincare related but the healthy food brand *YogaBar* was sold to ITC.\n\nIt fascinates me how small brands that we primarily buy from cause of trusting their ingredients, end up getting bought out by brands we avoid. Do these brands continue having autonomy on selecting ingredients? Do they have freedom on major decisions? \n\nIt is kind of discouraging that brands that we love have high chances of being sold off once they reach their peak. "
  },
  {
    "post_title": "Routine and products for wavy hair?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1e8lifk/routine_and_products_for_wavy_hair/",
    "score": 1,
    "author": "clumsy-af28",
    "created_date": "2024-07-21 12:45:29",
    "num_comments": 2,
    "selftext": "Hi , \nI have been reading posts on this sub but couldn’t find a full routine anywhere hence posting here. \n\nI have wavy hair mostly from bottom (havent tried cgm yet) , medium to low porosity (not sure), and not very dense. My hair are also frizzy without styling. I also have oily scalp mainly in monsoon. \n\nI had done smoothening once and for longest time have used straightner for styling. (Have stopped from a month)\n\nI want to start cgm for my waves , and in general have stronger denser hair. \n\nBut I am very confused reading everything still on \nA) what routine i should follow\nB) what products I should get for each part of routine. (This is where I am too confused)\n\nAs of now I just use love beauty planet argan oil shampoo. \n\nPlease help me out!!!"
  },
  {
    "post_title": "Has anyone experienced increased hairfall with fixmycurls products?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/172uc4g/has_anyone_experienced_increased_hairfall_with/",
    "score": 0,
    "author": "tytywho",
    "created_date": "2023-10-08 08:50:10",
    "num_comments": 3,
    "selftext": "Hi I (F26) recently went to a dermatologist who diagnosed me with female pattern hairloss stage 2 and prescribed minoxidil. I really don't want to deal with the dread shed and the side effects of minoxidil so I read up on Rosemary oil. I decided to try out fixmycurls for my curly hair (cleansing shampoo, everyday moisturizing shampoo and hydrating conditioner followed by Loreal Paris serum is the routine I'm following) because I saw the cleansing shampoo has Rosemary oil in it and I had heard good reviews about this brand. But I feel like everytime I wash my hair I'm losing more hair, not in clumps but still more than before ( I was using love beauty and planet before and honestly it was so good). I'm scared of losing more hair. I know probably minoxidil will help but I'm so scared of the dread shed. Does Rosemary oil also have a dread shed? Should I stop using this brand? Can anyone please suggest me what to do?"
  },
  {
    "post_title": "Need advice for newly coloured hair",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/177jf0h/need_advice_for_newly_coloured_hair/",
    "score": 2,
    "author": "man_v2004",
    "created_date": "2023-10-14 06:46:02",
    "num_comments": 0,
    "selftext": "As the title says, I've recently coloured my hair for the first time. It's a mix of browns, so I didn't need to lighten my hair or anything. I was advised by my hair stylist to use mild, SLS free shampoo. I've been using Love, Beauty and Planet products for a while so that's not a problem, but I'm unsure about whether or not I can use other products, namely TO Multi Peptide Serum and Juicy Chemistry hair masks. I normally apply the peptide serum once a week and the JC mask once in two weeks.\n\nI have an oily scalp and fine, mostly straight hair (I might be 1A or 1B, not sure yet and still learning these terms!). I also have the charcoal scalp cleansing mask from Briogeo which I don't apply very frequently, but is excellent at keeping my scalp clean and healthy. I want to be able to use this too. \n\nAny advice on what I can and cannot use would be very helpful! Thanks in advance!"
  },
  {
    "post_title": "Hair product recommendations for itchy scalp.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/usi0wl/hair_product_recommendations_for_itchy_scalp/",
    "score": 8,
    "author": "evanapradhan",
    "created_date": "2022-05-18 17:23:41",
    "num_comments": 8,
    "selftext": "So my hair is moderately thick, wavy and lately it’s been kinda dry and frizzy, but at the same time my scalp gets oily and itchy a day and a half after a bath (if that makes sense) so I need to shower every alternate day for relief. \n\nMy main problem rn is with the itchy scalp and my current routine is just love beauty and planet shampoo and conditioner (I was using himalaya for years but switched to this about a month ago) and no heat styling whatsoever. \n\nI scrolled all the way to the bottom looking for posts relating to itchy scalps so I figured I’d ask. Any hair products like oils, shampoos, conditioners etc would be really helpful thanks."
  },
  {
    "post_title": "Hair product recommendation needed please!!",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/17dkwwh/hair_product_recommendation_needed_please/",
    "score": 1,
    "author": "dindjarinthisdway",
    "created_date": "2023-10-22 04:14:49",
    "num_comments": 1,
    "selftext": "Hair type: Oily scalp, frizzy hair \nClimate : Hot and humid (even in winters\nAge: Early 20s ( I don't have pcod/pcos/thyroid related issues)\nHair concern: my hair is frizzy very frizzy. I am very new to this haircare thing and i use love beauty planet shampoo. I use loreal hyaluron range too. Please suggest a hair treatment and or mask to repair this. Any suggestions as well!! \nAlso is minimalist hair growth serum good?? Been facing hair thinning in the front partition line."
  },
  {
    "post_title": "Hair care reviews for frizzy hair!",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/13cgwi5/hair_care_reviews_for_frizzy_hair/",
    "score": 91,
    "author": "Efficient-Second-618",
    "created_date": "2023-05-09 05:48:19",
    "num_comments": 68,
    "selftext": "Hello everyone! I never thought I would review any products myself but I’ve ended up with a routine that has significantly worked for me and I don’t want to gatekeep! I’m not comfortable sharing before after pics but all I can say is I’ve spent yearsss trying oils and shampoos and I finally feel like these products have made my hair soft, manageable and presentable at least! 😭 ❤️ and it’s a fairly simple routine that I’ve developed for someone who sucks at dedicating time to take care of themselves (I’m 26 sheeesh)!\n\n&#x200B;\n\n**Hair type:** 2B fine hair, low density, low porosity\n\n**Climate:** Mumbai (mostly humid)\n\n**Usage timeline:** more than a month\n\n&#x200B;\n\n**Soulflower Rosemary Essential Oil with Coconut Carrier Oil -** I think this part of the process is making the most difference. I’ve started with adding a few drops of rosemary oil to the coconut only once a week for now cause I’ve heard rosemary is potent. I wash my hair every alternate day and I’ve been overnight oiling (just coconut) before every wash. If I’m adding rosemary I don’t necessarily do it overnight as an hour feels enough.\n\nSide note; this is the only brand I’ve tried for the rosemary oil so I’m not sure if it’s the best one. I’m yet to see it’s effects on the hair growth part.\n\n**Love Beauty & Planet Argan Oil and Lavender Shampoo -** my shampoo journey deserves a whole different thread probably but to cut it short; I tried the L’Oréal HA shampoo which was wonderful for hydration but made my scalp itchy like hell. Never before had a product reacted in such a conflicted way. But this!!! I read many positive reviews of the LBP one and saw it in many girls houses. Finally tried it and can confirm the hype. It makes the hair frizz free AND bouncy and smell like a lavender field, also minimal hair loss while shampooing.\n\n**Re’equil Babassu Anti Frizz & Smoothening Conditioner -** I use this on days I’m not able to oil and it’s worked like a charm. It’s super creamy so applies well on the hair, doesn’t buildup and does what it says. A little is a lot.\n\n**IHA Restoring Hair Serum -** **HG -** I chanced upon trying this because it was gifted to me; but it’s probably the most magical product from the list. If you apply it on towel damp hair it just detangles so smoothly without breaking, and locks in the hydration at the same time. Do not use it on dry hair as it’ll become lumpy.\n\n&#x200B;\n\nHope this helps, would love to discuss further!\n\nCheers!"
  },
  {
    "post_title": "Suggest a shampoo which literally cleans everything off my hair.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/130e6ng/suggest_a_shampoo_which_literally_cleans/",
    "score": 34,
    "author": "Just_Getting-by",
    "created_date": "2023-04-27 08:26:09",
    "num_comments": 75,
    "selftext": "Hi, can you suggest me a shampoo which removes everything (oil, silicones, old fragrance, etc) off my hairs, and doesn't leave any silicones, fragrance, nothing after washing away.\n\nSulphates, without sulphates, anything that works.\n\nI want to clean with such a shamoo, and then apply hair conditioner according to my hairs.\n\n___\n\nIf you think something is wrong with this method, please tell.\n\n___\n\nThanks for the suggestions everyone.\n\nSuggestions so far: {my comment} \n* Sunsilk Pink:  has silicones, also mica+Titanium Dioxide, which stays on hair after wash.\n*  Herbal Essences mint strawberry: has Conditioning agents in it, which forms a layer.\n* L'oreal extraordinary clay: has silicones and mica, which among other things remains on hair after wash.\n* * **Pantene lively clean**: Pretty close to what I am looking for. It has only one conditioning agent pentenyl ethyl ether, which is helpful/good, and mild fragrances.\n* Scalp Pro: has several ingredient which form film on hairs\n* Salon Shampoo: We don't know what do they have.\n* * **Faith in Nature** (you can consider if you don't have oily hair): Don't leave anything on hair other than glycerin, but is mild on cleaning.\n* L'oreal Dream Lengths: has silicones, mica, conditioning agents which stay on hair even after washing.\n* Love Beauty & Planet Apple Cider Vinegar: has silicones, among other things which stay on hair.\n* Arata Shampoo: has hydrators/emollients which form film on hair. (OT comment- it has several essential oils in 0.3% and lesser concentrations, as low as 0.025%, which won't give any observable results, if any.)\n* Re'equil Shampoo: has several film forming agents.\n* L'oreal Professional Instant Clear (Scalp Advanced Anti Dandruff): It do have multiple film forming agents.\n* Anomaly Clarifying Shampoo: Have multiple ingredients which stay after wash.\n* * **The ordinary shampoo**: Exactly what I was looking for, but expensive for me, so will have to do with Lively Clean.\n\nBold are either exactly or close to what I was looking for.\n\nbtw I am not some specialist, I read ingredients and search about them online. If you find something wrong please tell me.\n\n(All relevant suggestions added, as on 27 September 2023)"
  },
  {
    "post_title": "Clarifying shampoos in India",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/khyo81/clarifying_shampoos_in_india/",
    "score": 8,
    "author": "EphemeralLifetimes",
    "created_date": "2020-12-22 05:08:11",
    "num_comments": 18,
    "selftext": "Hey guys, do you know any clarifying shampoos in India without silicones, Methylisothiazolionone and Methylchloroisothiazolionone as preservatives? I tried using Re'equil hairfall control shampoo and my scalp has been in a catastrophic condition ever since, I figured it was the preservatives because this occured whenever I used any other shampoos with the same preservatives. And shampoos with mild surfactants just don't cut it for my hair, so I'm looking for shampoos with strong surfactants, no silicones, no MIT, and preferably less amount of perfuming ingredients.\nSo far I've come across:\n\nMatrix biolage shampoos (without MIT, but contains lot of perfuming ingredients)\n\nLove beauty and planet shampoo (without MIT, but three of more fragrance ingredients)\n\nEnliven shampoo (contains MIT)\n\nThanks in advance !\n\nEdit: If anyone's confused why I don't like MIT as preservatives, it's because it's been named contact allergen of the 2013, can possibly sensitize and irritate the skin, and in one of Dr Dray's video she reveals that these ingredients are highly problematic more so than parabens ever will be."
  },
  {
    "post_title": "What is Dimethiconol (and) Trideceth-10 (and) TEA-Dodecylbenzenesulfonate? Is it silicone or surfactant?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/uir2c9/what_is_dimethiconol_and_trideceth10_and/",
    "score": 1,
    "author": "qwerty_0123",
    "created_date": "2022-05-05 06:20:52",
    "num_comments": 5,
    "selftext": "I found this in Love Planet & Beauty shampoo. Dimethiconol is a silicone but the other two are surfactants. Why are they wriiten together like that?"
  },
  {
    "post_title": "which hair oil for hairfall?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/wabr98/which_hair_oil_for_hairfall/",
    "score": 1,
    "author": "22hotpotato",
    "created_date": "2022-07-28 14:42:17",
    "num_comments": 7,
    "selftext": "I've dry and frizzy hair texture but from past few days there's so much hairfall happening. I use love and beauty planet's shampoo and conditioner."
  },
  {
    "post_title": "Shampoo and Conditioner for Dry, Frizzy & Brittle Hair",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/10bqax6/shampoo_and_conditioner_for_dry_frizzy_brittle/",
    "score": 8,
    "author": "Kiki_Koko_Keke",
    "created_date": "2023-01-14 14:54:29",
    "num_comments": 17,
    "selftext": "In November, i switched to Love, Beauty & Planet's Argan Oil & Lavender shampoo and conditioner. So far, i would say it has worked on the APPEARANCE of my splitends. My hair LOOKS much softer(my ponytail looks straighter than it did before), but i can see that the splitends are still there, which results in my hair length not increasing.\n\nI have slightly longer than shoulder hair length. Have spiltends a lot. Dry , frizzy, and brittle hair. Low porosity hair. Also, i have very thin hair. Almost no volume at all. The volume of my hair looks like it has decreased they very next day after shampooing. I WANT TO INCREASE THE VOLUME OF MY HAIR(for which i'm planning to use some hair oils) and reduce splitends.\n\nI also use Plum's Avocado Hair Mask. It works very well in nourishing my hair.\n\nCould I please get recommendations on shampoos and conditioners that work for my hair type?[My hair very much looks like this](https://images.app.goo.gl/EfTTF1ksDUFop73K8)"
  },
  {
    "post_title": "L'Oreal Professional Hair Spa Deep Nourishing Conditioner | Opinions or Reviews?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/mfz89o/loreal_professional_hair_spa_deep_nourishing/",
    "score": 6,
    "author": "_kashipwreck_",
    "created_date": "2021-03-29 20:51:35",
    "num_comments": 19,
    "selftext": "Hi! \n\nI have virgin, 2b/2c hair that's dry, frizzy and super prone to split ends (like, 60% of my hair ends get split in less than 2 months of getting a hair trimming done).\n\nI have been using the Herbal Essences Argan Oil Shampoo + Conditioner combo for almost 2 years now, and have finished at least 2-3 bottles of each. The only other products I've used in the meantime are the HE Coconut Shampoo+Conditioner, the Love, Planet & Beauty Lavender Shampoo+Conditioner and the De Fabulous Reviver shampoo + conditioner (side note: STAY THE HECK AWAY FROM THIS IF YOU CARE ABOUT YOUR HAIR.) \n\nI'm now looking to change my conditioner (I'm alternating between the HE Argan Oil Shampoo and the Switch Fix Acai of Relief Shampoo Bar) -- has anybody tried the L'Oreal Professional Hair Spa Deep Nourishing Conditioner? (Attaching a picture / link in the comments) \n\nI'm confused between getting the L'Oreal Conditioner and the Re'equil Murumuru conditioner so any suggestions/opinions would be highly appreciated. Any other suggestions are super welcome too! (and possible discount codes if you know them 🙈)"
  },
  {
    "post_title": "Which hair mask is better?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ev6ck1/which_hair_mask_is_better/",
    "score": 7,
    "author": "kanii02",
    "created_date": "2024-08-18 10:46:06",
    "num_comments": 13,
    "selftext": "Hair mask recommendation needed. I heard dove range is good so which one do you all think works better. I have fine hair, 2a-2b, mid length with dry ends. Any other hair mask do you guys use?"
  },
  {
    "post_title": "Alternative for Freewill Shampoo & hair mask",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/s21e3d/alternative_for_freewill_shampoo_hair_mask/",
    "score": 1,
    "author": "Both-Jellyfish-1200",
    "created_date": "2022-01-12 08:33:27",
    "num_comments": 9,
    "selftext": "Hi, I have mostly Straight and slight wave in my hair with oily scalp and very very dry strands. I oil my ends regularly before wash, I break out on my scalp if I oil it too much. I get dandruff sometimes. After trying all the easily available shampoos & conditioners, I came across wavy/ curly hair videos and learnt about sulfate, silicone- free products. My first foray into this new world was me trying Freewill products, since Minimalist was all the rage at that point. It made my hair very soft, less frizzy, very healthy, not drying. \n\nI have tried Love, Beauty & Planet and Arganicare Coconut range, FW was much better for me. Recently purchased the newly launched Garnier Banana pair, slightly drying.  FW felt the best by far.\n\nAlso, I've tried wavy/ curly products, they weigh down my hair too much. I deep condition weekly, clarify, etc. More than these, I feel the FW pair helped me better. \n\nCan anyone help me with an alternative to this shampoo & mask pair?"
  },
  {
    "post_title": "PLEASE HELP me save my hair ",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1egp67c/please_help_me_save_my_hair/",
    "score": 0,
    "author": "Clean_Moment8589",
    "created_date": "2024-07-31 14:52:51",
    "num_comments": 11,
    "selftext": "I have curly hair and my problem is they are all over the place, they're very rough, damaged, frizzy and probably have split ends ( many on a single strand), I'm confused what to do with it, should I do so treatment or cut it off completely (which I REALLY don't wanna do rn) they look dead and lifeless,I consulted a dermat but she just suggested me hair oils and serums worth 2000 rs each, and other expensive things as well, please suggest me some products or treatments that might help with it, my budget is 2000-2500 rs"
  },
  {
    "post_title": "what exactly is this product? leave-in conditioner spray?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/1ei22k9/what_exactly_is_this_product_leavein_conditioner/",
    "score": 3,
    "author": "chunnu-23",
    "created_date": "2024-08-02 05:22:06",
    "num_comments": 3,
    "selftext": "guys i stumbled across this product on nykaa during my hunt for a good leave-in conditioner spray. now it doesn’t say anywhere that it is a leave-in conditioner but the usage and everything is the same the same as leave-ins. \n\nif anyone has used this product, please give a review of this. also, recommendations for a leave-in conditioner sprays are welcome, i an currently using the schwarzkopf moisture kick spray and looking for a change. TIA🧚🏻‍♀️"
  },
  {
    "post_title": "Hydrating/Non-Drying Body Wash Guide + Huge Products List",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/nsnpb8/hydratingnondrying_body_wash_guide_huge_products/",
    "score": 296,
    "author": "SKMean",
    "created_date": "2021-06-05 04:34:31",
    "num_comments": 80,
    "selftext": "IMPORTANT ANNOUNCEMENT: Do not use my work on any platform without prior permission. Ask first! \r\n\r\n\r\nHey everyone! So here I have a guide to moisturising/non drying body washes with experience test to see whether it’ll work for you or not.\r\n\r\nSo how do you find one? Its simple as you only have to find some ingredients i.e. Polyquaterniums(also referred as polyquats or PQ) OR  Guar hydroxypropyltrimonium chloride(GHPC, let it stay on skin for a minute or two). \r\n\r\nThese are film forming agents that will form a protective layer on your skin. They have been around for a long time, intensively researched and can be used on your whole body including skin(including face) and hair. Since the silicone scare happened, their usage have increased exponentially. You’ll find them in your hair masks, shampoo, conditioners and even some face washes.\r\n\r\nSo you need to find one specific polyquat in your body wash i.e polyquaternium-7 (also written as polyquat-7 or PQ-7). This is the gold standard polyquat to help moisturize and soften the skin in body washes. Polyquat-10 will also do but PQ7 is the gold standard.\r\n\r\nSo now I’ll come to the test. This test is based on YOUR experience. So ik due to current pandemic situation you don’t wanna spend on unnecessary things. So I’ve mentioned the list of all body wash I could find with PQ7 and I’m sure that you would have used atleast one from them and if you felt that below mentioned products worked for you in the past and you left them thinking them to be too commercial or it moisturised or at the very least it was non drying to your skin, then Polyquats and GHPC are your gold ingredients to find in a bodywash. I will also mention some common tips that helped me after the products list.\r\n \r\nI went through whole body wash section on nykaa for this list. \r\n\r\nProducts list(including cheapest and expensive):\r\n\r\n1.\tPalmolive (absolute relax, morning tonic, luminous oils, sensual)\r\n\r\n2.\tNivea (Fresh pure, protect n care, energy, cool kick) \r\n\r\n3.\tCamay Paris (lavande, romantique, crème n strawberry, hypnotique, dynamique)\r\n\r\n4.\tBody Cupid (24k gold, beautiful rose)\r\n\r\n5.\tKaya (colloidal oat, tea tree n honey)\r\n\r\n6.\tBoro Plus (neem lavender, almond turmeric)\r\n\r\n7.\tSwiss Tempelle (tulsi&iris)\r\n\r\n8.\tWow (ubtan, rose otto, acv, peach & strawberry, pineapple n coconut, lemon n pine, pine n rose, melon n cucumber, green apple, valencia orange, cherry blossom, lavender n chamomile, tea tree n mint, wild aqua)\r\n\r\n9.\tAll nykaa wanderlust series(PQ7 + silicon oil)\r\n\r\n10.\tSolimo by Amazon (fresh lavender, sweet apricot, lemon n tea tree, cool menthol, antibacterial with SA)\r\n\r\n11.\tMamaearth (all PQ22 based)\r\n\r\n12.\tDettol all variants (PQ10 + BHA)\r\n\r\n13.\tPlum BodyLovin shower CREAMS (All are PQ7 based)\r\n\r\n14.\tSt. Botanica (peach n avocado, strawberry n vit e, argan oil)\r\n\r\n15.\tLove Beauty & Planet all range (cetrimonium chloride & GHPC based)\r\n\r\n16.\tSt. D’vence (ocean drop, pink salt, hemp n aloe, lime n basil, Alphonso mango)\r\n\r\n17.\tMan Arden (Pacific prince, tahitis exotic, lemon n mint, energising, bergamot n cedarwood, arabian oudh)\r\n\r\n18.\tSedure whole range (PQ is unconfirmed)\r\n\r\n19.\tOlay whole range (GHPC based. Needs to stay on skin for some time)\r\n\r\n20.\tSuperdrug (coconut n white peach, fruity coconut)\r\n\r\n21.\tAveeno daily moisture (PQ10 + GHPC), skin relief(GHPC Based)\r\n\r\n22.\tThink skin by big bazaar (neem, total moisture)\r\n\r\n23.\tLocal companies in your city.(usually found in supermarkets like dmart, big bazaar)\r\n\r\n24. Cetaphil restoraderm(GHPC)\r\n\r\n25. NMFe body wash(GHPC derivative)\r\n\r\n26. The skin cottage, whole range (PQ7 based. Some have different PQ)\r\n\r\n27. Moisturex body wash (PQ67 based)\r\n\r\n28. Sirona therapeutic body wash (GHPC)\r\n\n29. Dermadew body wash(PQ10) \r\n\n30. Parasoft moisturizing shower gel(GHPC+SQ8)\r\n\r\nTips: While rinsing out, try not to rub your skin. Use the softest towel you have. If possible only pat dry and avoid rubbing towel rigorously.\r\n\r\nConsidering the nature of polyquats, these products mostly will work the same for you. So that means you have so much fragrance options to choose from.😇 The list may or may not have fragrance free options. I haven't checked for fragrance. \r\n\r\nIf you are new to trying these ingredients, I personally recommend Nivea Fresh Pure for first timers. It has the softest foam ever. Very mild, fresh aquatic fragrance and has been on market for years. \r\n\r\nThere can be an instance where these products are not moisturising enough for you but they’ll be atleast non drying.\r\n\r\nAlways prefer to shop offline as most of nivea and some other brands are always on BOGO(like in dmart and big bazaar). Also be on the lookout for local companies in supermarkets bcz they will be even cheaper. (find PQ7)\r\n\r\nIF YOU HAVE A PRODUCT WITH ABOVE MENTIONED INGREDIENTS (PQ7, PQ10 OR GHPC) AND NOT IN THE LIST ABOVE THEN MENTION THEM BELOW SO THAT EVERYONE CAN HAVE MORE OPTIONS. 😇"
  },
  {
    "post_title": "A story about hair",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/pc3uiu/a_story_about_hair/",
    "score": 83,
    "author": "katanj",
    "created_date": "2021-08-26 17:08:42",
    "num_comments": 40,
    "selftext": "This is going to be a brief consolidation of what I've learnt about my hair, what products I've tried, whT treatments I've tried, etc. Hopefully it will help someone and you don't have to do as much trial and error as I did 😀 \n\nMy hair type: I don't know where it falls in the curly scale but basically it's straight/wavy at the top and forms curls at the ends.\nLow porosity\nCurrently virgin hair (though I've lightened it in the past)\nScalp: again, I don't know what to classify this but I can tell you one thing: it's an asshole. Lol. It's very prone to itchiness, bumps, dandruff, oiliness, very sensitive. Literally my scalp starts hurting if I go too long without washing.\n\nProducts used chronologically:\n\nLoreal mythic oil\nThis was reccomended to me by my hairstylist who is a good hairstylist but obviously affiliated with loreal (which I didn't know at the time 🤔) \nThis stuff was just ok. Like I had to shampoo twice atleast to remove oil and it didn't do anything great for my hair. Didn't spoil my curl pattern but I just didn't like it much.\n\nFast forward about a year and I decided to try something different.\nI stopped at the local health and glow and picked up ogx biotin and collagen shampoo.\nAnd I quite liked it!. It made my hair soft but textured and enhanced the natural curl of my hair.\n\nThat ought to have been the end of my product search but since I'm a meddler, I of course had to try something new.\n\nSo I went to a new salon near my house on one of my birthdays and got a moroccan oil hair spa done. And I was in love. My hair was soft and silky and smelled like all the good things in the world! So I went and spent a small fortune on moroccan oil shampoo and conditioner.\n\nAs the months went by, my hair grew out from its shoulder length cut and I started to notice that the natural curl was gone. I was NOT happy but I assumed it was just the length weighing it down.\n\nThen someone gifted me a love beauty and planet shampoo. So I thought why not try it out. And out bounced my curls right after I dried my hair! I don't know what was going on with the moroccan oil that it straightened out my hair. I don't think it was product buildup because after I realized that the moroccan oil was straightening out my hair, I went on Google , learned about product buildup and tried clarifying my hair. It didn't seem to help.\n\nSo I thought I would shift to the love beauty planet shampoo and conditioner but I couldn't make up my mind and I kept alternating between the two shampoos.\n\nFast forward to lockdown where I had the very clever idea of cutting my hair into a long bob. I straightened the hair like a genius, thinking it would be easier to get a straight cut and handed my mom the kitchen scissors. As common sense would tell anyone, it didn't go well. My hair was lopsided and just around the length of my earlobe. I was DEVASTATED. I know, a lot of drama about hair especially in the middle of a pandemic but, you know.\n\nThis however, turned out to be a blessing in disguise as I took a deep look at my hair habits. I looked back to admire my photos from before all the fancy shampoos and realized how much hair I'd lost in the process of constantly cutting, often lightening, and pouring products on my hair without any care as to what it contained.\n\nSo then I went and looked further back at school pictures. My hair routine is school was simple. My mom would put fenugreek paste or oil on  my hair once a week. I would was with baby shampoo only (no conditoner). And I had so much hair!!! Now don't get me wrong, the condition of the hair was like a rats nest all dehydrated and poorly styled. But the hair itself was great .\n\nSo now I've dedicated myself to reclaiming my childhood hair just like many of you in the sub and here's what I've tried, what worked and what didn't.\n\n1. Oil\n\nI watched ayesha malik's video and immediately went and bought wishcare jamaican black castor oil and tropic isle living red pimento oil.\nAnd I did notice some hair growth.\nSo I reccomended both to my friend. She bought the wishcare oil and had HORRIBLE hair fall.\nWhen my wishcare bottle got over, I saw that the tropic isle living black castor oil was back in stock on naturally youme and it wasn't much more expensive than wishcare so I decided to try that.\nI could tell the difference as soon as I opened the bottle.\nThe wishcare one smelled kind of burnt and was blackish in color, whereas the tropic isle one had a more nutty smell and had a more dark amber color.\nI noticed new hair growth within a few weeks of using it.\n\nI suspect the wishcare oil was bad for the scalp but I think I escaped the hairfall my friend suffered because I used only a little of it along with more of the red pimento oil. So, narrow escape for me.\n\nI tried some other oils including forest essentials oil and some local ayurvedic oils. Red oil did work well and I still use it.\n\nI know a lot of people on this sub find oils to really harm their hair, but it has worked for me.\n\n2. Shampoo and conditioner.\nI stopped using all salon products and started looking into the ingredients of my hair care products the same way we look at skincare products.\n\nFirst, I tried Giovanni shampoo (the green tubes). It was fairly cost effective and it seemed to be great for the hair however, I started breaking out in my hairline and I had to stop using it.\n\nThen, I tried the forest essentials shampoo. I got the mini ones and used most of the bottle before I realized that it makes my hair rough. I left it sitting on the bathroom counter for a few months. Two days ago I ran out of my current shampoo and so decided to use the remaining forest essentials shampoo. That night I woke up in the middle of the night with the most horribly itchy scalp I've ever had. I guess they don't use preservatives (atleast it's not listed on the bottle) and I'm sure the humid bathroom environment didn't help the formula stay good. So guys please be careful with these so called natural products. If you use these kinds of products, I would suggest you buy small bottles and use them fast. Don't leave them sitting around. And don't use them after a long gap.\n\nFinally, I researched more and came across the true frog shampoo and conditioner. And I love it! It's gentle enough for my hair. I do have to double cleanse if I've applied oil, but even then it doesn't dry the hair. It's fairly affordable. I like their principle (atleast the one they advertise). They include natural ingredients but they don't go overboard with the ridiculous no chemicals craze. I'm currently finished with one bottle of anti hair fall shampoo and daily conditioner and I've ordered another pair. \n\nHaven't tried their hairmask or skin products. If anyone has, do let us know how they are 🙃\n\nHair mask: ok I know I just bashed the forest essentials shampoo.... but I do love their hair mask. I haven't had issues with it going bad but then I use it fairly fast and don't keep it in the bathroom where it's humid.\nI also really like their hair vitalizer as it soothes my scalp(though it is a tad sticky).I do however think you can make this at home rather than paying their exorbitant bankruptcy inducing prices \n\nHome remedies:\nAfter reading on this sub about flaxseed gel, I whipped up a batch and tried it and you guys it's BOMB. I put a ton on my hair and when I brushed it out my hair was soft and my scalp was soothed. I didn't even have to shampoo it out. So a big thank to the sub for this discovery.\n\nFenugreek: I asked my mom to make the same paste she did for me when I was younger and have started using it recently. Fingers crossed that it helps.\n\nOne more thing-- I had to areas on the sides of my head where I noticed my hairline was thinning. After doing some research, I realized it was traction alopecia. So I've been trying not to pull my hair back tightly as well as applying the treatments/oils/hair masks specifically to those areas. It's helping but slowly. So watch you hairline girls and guys who pull your hair back tightly.\n\nFinally a note on salons. Please don't buy into everything you hairdresser says. So many of them are way too smooth at convincing you that you absolutely need some product or treatment. Especially my curly haired gals and guys don't fall for their attempts to sell you on keratin treatment if you don't want it yourself. My friend has super curly hair and whenever she goes for a haircut, they start harping about keratin. One of the hair dressers tried to convince me that I had bad hair thinning and that I absolutely required the 15k kerastase densifique treatment + 4k each shampoo conditioner +twice weekly spas. Sadly I was almost convinced I had a problem and I bought the shampoo (obviously the rest was wayy too expensive) and kept harping about my supposed hair loss until I actually checked my scalp on the mirror and compared it with photos from the internet and realized it was normal. So please take the words of hairstylists with a pinch of salt. In fact the higher end salons, try to sell you stuff more than the normal salons, in my opinion.\n\nHope this wasn't a too long, boring read 😴. Do share any advice you have for me and my hair 🙃"
  },
  {
    "post_title": "Recommend moisturising sulphate-free shampoo",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/17n1a7l/recommend_moisturising_sulphatefree_shampoo/",
    "score": 6,
    "author": "anyaonlytime",
    "created_date": "2023-11-03 18:13:35",
    "num_comments": 3,
    "selftext": "Hair type : 2A \n\nbudget : resonable\n\nstill looking for a shampoo I can call my HG"
  },
  {
    "post_title": "Body Care Products",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/zuvq3b/body_care_products/",
    "score": 42,
    "author": "brainlobeo2",
    "created_date": "2022-12-25 10:36:17",
    "num_comments": 30,
    "selftext": "Hi,\n\nI'm 27F with dry skin. I have PCOS - hence hyperpigmentation in quite a few areas. Another issues is my back acne. I also have terrible allergies to mosquito which leaves dark spots all over my legs. These are my current body care products. Kindly feel free to ask anything.\n\n[Body Care products](https://preview.redd.it/cq19mqaxs08a1.jpg?width=1280&format=pjpg&auto=webp&s=1c018399469912f5f73b8f454e0b46dfcceab285)\n\nBody wash\n\n1. [Love Beauty & Planet Natural Murumuru Butter and Rose Sulfate Free Body Wash](https://www.nykaa.com/love-beauty-planet-murumuru-butter-and-rose-aroma-bountiful-moisture-body-wash/p/575171) \\- Does the job, cleanses well. It has a base of coconut oil and murumuru butter. I suffer from back acne/bacne so I do not use this on my back or if I do, I dilute it in water a lot then use it to cleanse it. It is a gentle body cleanser. Coconut oil doesn't suit my skin and generally not recommended to oily skin peeps (although I have dry skin) as it can clog pores. Murumuru butter is less comdeogenic and that is an ingredient I like. This body wash give me soft skin post shower. WNRP (because I was recently gifted with 5 gift sets from bath & body work which has shower gel in it)\n2. [Bodywise 1% Salicylic Acid Body Wash](https://www.amazon.in/Bodywise-Salicylic-Prevent-Cleanse-Paraben/dp/B09SLYBCGW) \\- Great exfoliation prior to body shaving. Before this I used it for my KP although it only had a minor benefit. This did help to prevent ingrowns post shaving by using it to wash my body before shaving. WNRP (because I am testing out other products but if none of those work, I will get back to it)\n3. [Dove Shower Mousse with Argan Oil](https://www.nykaa.com/dove-shower-mousse-with-argan-oil-200ml/p/857995?ptype=product&skuId=857995&utm_content=ads&utm_source=GooglePaid&utm_medium=PLA&utm_campaign=PerformanceMaxFullsite&gclid=CjwKCAiAhqCdBhB0EiwAH8M_GlaawQ9iyADwT4GJU3sHZ7ukxHLZZi0uXmWktDhccpxv1pKBG53DsxoCqIsQAvD_BwE) \\- I use this while shaving and it provides a good medium to achieve close shave without nicking the skin. WRP\n4. [Dove Exfoliating Body Polish Scrub with Crushed Macadamia and Rice Milk](https://www.nykaa.com/dove-exfoliating-crushed-macadamia-and-rice-milk-body-polish-298gm/p/774748) \\- A very good physical exfoliant for body. I use this weekly once and it gives me smooth super soft skin. This softness hasn't been replicated by other products. WRP (but I do want to try other variants of this - [kiwi](https://www.nykaa.com/dove-exfoliating-kiwi-seeds-and-cool-aloe-body-polish-298gm/p/774747?root=cav_pd) and [pomegranate](https://www.nykaa.com/dove-exfoliating-pomegranate-seeds-and-shea-butter-body-polish-298gm/p/774746?root=cav_pd) \\- if you have used all three, let me know which works for you the best)\n5. [Paknet Creamy Wash](https://www.netmeds.com/prescriptions/paknet-creamy-wash-50gm?source_attribution=ADW-CPC-Pmax_pharma-PY-Netmeds_Vib_PMax&utm_source=ADW-CPC-Pmax_pharma-PY-Netmeds_Vib_PMax&utm_medium=CPC&utm_campaign=ADW-CPC-Pmax_pharma-PY-Netmeds_Vib_PMax&gclid=CjwKCAiAhqCdBhB0EiwAH8M_GgkePXTPlbfZIdAAXYuBIMp4ZXnegQwCdj7wd0TksQpN2oqi7ls7aRoCV8UQAvD_BwE) \\- 4% benzoyl peroxide for my back acne, effectively reduced it. I also started washing my back with this post conditioner and not prior and that could have also played a role. WRP: WNRP (unless it flares up again)\n\nBody moisturiser + SPF\n\n1. [Cera Ve SA Cream](https://www.amazon.in/CeraVe-Smoothing-Cream-Moisturiser-Smoother/dp/B07W8H8MBX) \\- My KP has resolved with this. Leg is smooth and I love it.  This contains salicylic acid, niacinamide, and ammounium lactate (lactic acid) - which helps with exfoliation and brightening dark spot (as I have many spots from mosquito, this has helped them lighten them).  WRP (very expensive here, so will look out for other products but this huge tub will last me for a long time, by then I should be able to ask a friend to get it from the states or during amazon sales)\n2. [Glyoc 6](https://www.netmeds.com/prescriptions/glyco-6-cream-30gm?source_attribution=ADW-CPC-Pmax_pharma-PY-Netmeds_Vib_PMax&utm_source=ADW-CPC-Pmax_pharma-PY-Netmeds_Vib_PMax&utm_medium=CPC&utm_campaign=ADW-CPC-Pmax_pharma-PY-Netmeds_Vib_PMax&gclid=CjwKCAiAhqCdBhB0EiwAH8M_Gs1aKNdEX02MfJqw3SW6TfF8s8AlWeZmvvUYFo91Qzwrx-oT7oXPuBoCYSEQAvD_BwE) \\-  NOT PICTURED (I forgot...) - This is available in 6 and 12 percent of glycolyic acid. Since I already use a decent amount of exfoliation products, I choose 6% for the remnants of dark spots and this has been helping it completely fade away. WRP (until needed)\n3. [Cetaphil Moisturizing Cream for Dry & Sensitive Skin](https://www.amazon.in/cetaphil-Moisturizing-Cream-Sensitive-Skin/dp/B07B8LGYFH) \\- NOT PICTURED (I'm a forgetful person okay... sorry) - Love this. Very moisturising, doesn't leave a sticky feeling or oily look. My skin absolutely loves it and drinks it all up. I use it on my face and body when I just need moisturise or when I have any skin irritation. I apply this and slug with [Cera Ve Healing ointment](https://www.amazon.in/CeraVe-Ointment-Petrolatum-Ceramides-Protecting/dp/B016F3MGQ6) (basically petroleum jelly/vaseline with ceramides, love it and is one of my HG products. Will post my HG products in couple of days/weeks).  WRP forever\n4. [NIVEA Sun Lotion, SPF 50, with UVA & UVB Protection, Water Resistant Sunscreen](https://www.amazon.in/Nivea-SPF-50-Moisturising-Lotion-125ml/dp/B00E96MU5E) \\- Good body sunscreen. Was previously using the [Vaseline SPF 30](https://www.amazon.in/Vaseline-Pollution-Protection-Body-Lotion/dp/B07W7D9NSB) and that obviously did not prevent body tanning. This has prevent further tanning. Current HG sunscreen for body. I'm also using [uv doux sunscreen](https://www.amazon.in/Brinton-Healthcare-Uvdoux-Face-Body-Sunscreen/dp/B01FS8F19S) in between as I cannot use it on the face because it makes my face very very greasy. WRP\n\nBody oil\n\n1. [Bath & Body Works Comfort Vanilla & Patchouli Body Oil Melt](https://www.ebay.com/itm/304637645639) \\- This is amazing. I love it, a good body oil. Reminds me of cleansing balm without all the mess. This is nicely absorbed by skin, leaves a beautiful shine and glow without making my skin feel or look oily. Doesn't leave oily imprints. Smells is very gourmand, I am usually a fan of good vanilla scents, this has a very luxurious vanilla scent which lasts relatively for a decent amount of time. Provides good moisture retention and soft skin. WRP if available in India, this seems like a difficult product to find (this was a gift to me, the person who gifted bough it from Canada)\n2. [Plum BodyLovin Vanilla Vibes Body Oil](https://kindlife.in/plum-bodylovin-vanilla-vibes-body-oil-100ml/?gclid=CjwKCAiAhqCdBhB0EiwAH8M_GhDFMHZVaHreKjT6skTeIUTT3gnSxCQBWnJTa9Ct_QwAAVLlvrcBOhoCsq4QAvD_BwE) \\- A relatively cheap duper for the BBW oil melt mentioned above. This smells like vanilla essence. Smells very strongly from bottle but upon application the scent is very mild. Makes skin shiny but gives it an oily look, although it does get absorbed completely in less than an hour or two, leaving no scent or oily look or moisture retention. WNRP\n\nUnderarm & Initimate Area, Neck, Chest Products\n\n1. [Sanfe Underarm Detox Exfoliator](https://sanfe.in/products/sanfe-underarm-detox-exfoliator-50g) \\- not a fan of sanfe products and their \"whitening\" schemes. But parents worry about their kids unnecessarily so I received bunch of products from them to target hyperpigmentation. This did reasonably exfoliate although I prefer my routine body products for my underarms. I did not see any huge benefits from it despite having some really good ingredients. WNRP\n2. [Sanfe Underarm Anti-Perspirant Deo Cream](https://sanfe.in/products/sanfe-underarm-anti-perspirant-deo-cream-60g) \\- Did nothing, provided some scent for maybe an hour or two but otherwise it really did nothing for me. WNRP\n3. [Sanfe Underarm Depigmentation Serum](https://www.amazon.in/Sanfe-Underarm-Lightening-Depigmentation-Serum/dp/B095YSQYW8) \\- What do you think? Ding ding ding, correct. Did not help although I enjoyed the scent it provided. Very clean smell. WNRP\n4. [The Formula Rx Roll On](https://theformularx.com/products/roll-on) \\- Due to PCOS I do have hyperpigmentation in many areas including under arms and this has single handedly reduced it and provides a decent chemical exfoliation. Controls odour and sweat I guess (I do not have sweat issues so not a good judge of that). WRP\n5. [Sanfe Intimate Lightening Serum](https://www.amazon.in/Sanfe-Intimate-Lightening-Brightening-Application/dp/B08H8JXTW5?th=1) \\- Surprisingly provided minor benefit by reducing hyperpigmentation by a little and also helped with moisturising the area pretty decently post shower. WNRP\n6. [LacSoft Cream](https://www.apollopharmacy.in/otc/lacsoft-cream-50gm?utm_source=google&utm_medium=pmax&campaignid=15756764351&adgroupid=&keyword=&device=c&adtype=pla&product_id=LAC0336&utm_campaign=PMax_Pharma_150Pincodes&gclid=CjwKCAiAhqCdBhB0EiwAH8M_Gr6NK4WOCU0JJelgrvmDmahkE3pzEqnQoQJ9YS8XosKC9zVy3zBFIxoCU48QAvD_BwE) \\- HG for my acnathosis nigricans. It contains a 12% ammonium lactate and I have previously [posted](https://www.reddit.com/r/IndianSkincareAddicts/comments/zbgu8t/lacsoft/?utm_source=share&utm_medium=web2x&context=3) about this. Immediate results was seen, although I wouldn't advise using it without a doctor's consultation. My hyperpigmentation is barely noticeable anymore. Very thankful for the product. WNRP (it is a pretty strong exfoliant with strong ingredients so currently taking a break from it until it is really required in the far future)\n\nFoot cream\n\n1. [Himalayan Wellness Foot Care Cream](https://www.amazon.in/Himalaya-Wellness-Foot-Cream-50gm/dp/B006G83LW4) \\- It did lilterally nothing for me. I got this after being recommended by many irl but a big no. WNRP\n2. [Kerasal Exfoliating Moisturizing Foot Ointment](https://www.amazon.in/Kerasal-Exfoliating-Moisturizing-Foot-Ointment/dp/B002W8C1AA) \\- A single use has provided with large noticeable changes, made my feet very soft and repaired my cracked heels almost completely. I have not been using it consistently but still has provided me with soft feet. Love it. WRP\n\n[Close up 1\\/4](https://preview.redd.it/2h91l7mzs08a1.jpg?width=1086&format=pjpg&auto=webp&s=a8368327f08ec87aefda74d303381af6159b40be)\n\n[Close up 2\\/4](https://preview.redd.it/rkvhtf92t08a1.jpg?width=960&format=pjpg&auto=webp&s=5960248080b945970f4beeda52f4dc3d6be1646d)\n\n[Close up 3\\/4](https://preview.redd.it/tc6k3tz4t08a1.jpg?width=960&format=pjpg&auto=webp&s=c0e8ff2ed396990dd6de0766f243e2f6aba2f85f)\n\n[Close up 4\\/4](https://preview.redd.it/qyr39gu5t08a1.jpg?width=1280&format=pjpg&auto=webp&s=fa9a9158887901ef986babc59a90d3682b807667)\n\nOther Products (Previously used)\n\n1. [The Ordinary Lactic Acid 10% + HA](https://www.nykaa.com/the-ordinary-lactic-acid-10percent-ha-2percent/p/5003150?productId=5003150&pps=1)\\- NOT PICTURED (yep, forgot..) - Great for removing tan, used to use it but currently only using it on my face because of other products. WRP (for face)\n2. [The Ordinary AHA 30% + BHA 2% Peeling Solution](https://www.nykaa.com/the-ordinary-aha-30percent-bha-2percent-peeling-solution/p/5003149?productId=5003149&pps=1) \\- NOT PICTURED - Used to use if for dark spots and thickened skin folds, very good. It's currently over and threw away the bottle so couldn't be picture (heh not memory this time). WNRP (maybe in the future if required but so far all those products are working so don't require it)\n3. [The Dot & Key CICA + 2% Salicylic Body Spray With Tea Tree Oil](https://www.dotandkey.com/products/cica-calming-back-body-skin-clarifying-spray) \\- NOT PICTURED (yep, forgot, wtv :p ) - Did absolutely nothing. Just found it to be a waste of money for me. Really provided my skin with no benefits, very disappointed. WNRP\n\nI have also used both the minimalist and the ordinary salicylic acid serums but I have not been consistent with it so cannot provide accurate feedback. Maybe I will get back to them once my cera ve SA cream is over.\n\nThank you for reading, feel free to comment or dm me any questions you have regarding this. I hope this helps. Merry Christmas (Happy Holidays) and a Happy New Year! Stay safe and take care.\n\nEdit: Fixed the WRP WNRP properly, sorry for the confusion."
  },
  {
    "post_title": "Any good shampoo",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/12z5l65/any_good_shampoo/",
    "score": 1,
    "author": "raiden4086",
    "created_date": "2023-04-26 03:53:05",
    "num_comments": 5,
    "selftext": "Can somebody suggest me a good shampoo for mildly oily hair that is clean (paraben,sls,sodium benzoate free)"
  },
  {
    "post_title": "Good sulphate and paraben free shampoo for dry/frizzy hair?",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/sk9d7k/good_sulphate_and_paraben_free_shampoo_for/",
    "score": 6,
    "author": "sventhedogofpewds",
    "created_date": "2022-02-04 09:39:01",
    "num_comments": 25,
    "selftext": "I am looking for a mild shampoo which I can use regularly and which doesn't cause/accelerate hairfall. Just for cleaning the scalp."
  },
  {
    "post_title": "Recommendation for good onion (and black seed) oil",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/xq7qq8/recommendation_for_good_onion_and_black_seed_oil/",
    "score": 10,
    "author": "UsernameOption6298",
    "created_date": "2022-09-28 09:14:10",
    "num_comments": 14,
    "selftext": "I have been experiencing some hair fall and hair thinning for a while. I decided to try diy onion juice and was happy with the results. Only problem is that it is becoming tedious for me and I end up postponing wash day as I am determined to make and use it. What finally happens is that my hair gets greasy and I have to wash it asap without the onion juice. I know fresh onion juice is more effective but that is not working for me (the hassle not the efficacy). I would like to try a store bought onion oil preferably with other key ingredients like black seed that I’ve heard is good. There are so many products online and I’m not sure how to navigate. Kindly let me know which ones are worth it. Thanks."
  },
  {
    "post_title": "Year-End Mini Reviews - Part 2: Haircare",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/kkjrk6/yearend_mini_reviews_part_2_haircare/",
    "score": 71,
    "author": "nishwho",
    "created_date": "2020-12-26 14:56:29",
    "num_comments": 22,
    "selftext": "Hey guys! Here are mini-reviews of some hair care products I used this year! I have 2B/2C curly hair which can get really frizzy, I also suffer from dandruff.   \n\n\n• Hair Oils:   \n\n\n**Urban Botanics Cold Pressed Jojoba oil**: First time trying out a jojoba oil and everyone in my family loved it! I was surprised by how lightweight and yet nourishing it is. It has helped my sister's hairfall and is a brilliant oil in general. WRP (might try a different brand though)  \n\n\n**Soulflower And Natural Rosemary Lavender Healthy Hair Oil**: Such a relaxing and nourishing hair oil. It has helped with hair fall and in making the hair smoother and healthier. WRP!  \n\n\n**Soulflower Bhringraj Oil**: This oil along with the above lavender one really works well for my hair as well as my family's. We try to use them weekly and have definitely seen an improvement in hairfall and the quality of our hair.  \n\n\n**Pure Rus Cold Pressed Neem Oil For Hair And Skin**: I bought this in the hopes that it would help me with my dandruff and itchy scalp. Tried it so many times in different concentrations but it hardly made a difference. Plus it's so hard to wash off and smells overpowering. WNRP.  \n\n\n• Shampoos:  \n\n\n**WOW Coconut Milk Shampoo**: I quite like this shampoo. It is an affordable CG friendly shampoo that lather well, doesn't leave the hair dry and is pretty creamy as well. WRP till I find a better one.  \n\n\n**WOW ACV Shampoo**\\*\\*: This shampoo has a very strong fragrance and it did a very poor job at cleansing my scalp. My fair felt dirty even after using a huge amount of the shampoo. It also did not remove the oil from my hair whenever I had tried it after a good oil massage. ACV is known to cleanse and clarify, this shampoo, however, didn't do any of it. WNRP!  \n\n\n**Mamaearth Tea Tree Shampoo**: I bought this shampoo mainly to deal with my itchy scalp and dandruff. It does clean the hair well, but it didn't really do much for dandruff itself. The consistency is also a little hard to work with and tangles my hair a lot. I'm honestly trying to finish it off and WNRP!  \n\n\n**Love Beauty & Planet Murumuru Butter and Rose Shampoo**: This is not a CG friendly shampoo as it contains sulfates (which I don't mind much). The problem with this is that it is way too drying and leaves my hair feeling lifeless. Sucks because I bought it after reading so many good reviews and don't know what to do with the nearly full bottle anymore. WNRP.  \n\n\n• Conditioners/Deep Conditioners:  \n\n\n**Re'equil Babassu Hair Conditioner**: I absolutely love this conditioner. It is so amazing at providing moisture to the hair and works perfectly for me as a leave-in conditioner as well! I scrunch it in my hair and it really helps bring out my curls. It adds a lot of shine to my hair and keeps it manageable for at least 2-3 days. WRP!  \n\n\n**Mamaearth Argan Hair Mask**: Contrary to the shampoo, I really adore this hair mask by Mamaearth. It makes my curls tighter and really helps when my hair is lacking protein. I try to do it once every 2 weeks! It leaves my hair feeling really soft and lasts a long time as well. WRP! One caution: It might not suit you if your hair is protein sensitive  \n\n\n**Flawsome The Wild Bananas Moisturizing & Smoothening Hair Mask**: It is sufficiently thick and creamy and yet spreads out easily with a comb. My hair feels very moisturized, soft and less frizzy than usual after using this mask. Continuous use of it has also improved my hair texture. WRP along with the Matrix Biolage deep conditioner!  \n\n\nCurl Cream/Gel:  \n\n\n**Schwarzkopf Osis + Curl Honey Curl Cream**: I sometimes like to use this curl cream just to give my hair some extra love and nourishment. It has a great texture but I feel it doesn't really make a lot of difference and is a so-so product. WNRP.  \n\n\n**Set Wet Style Vertical Hold Gel**: I started my CGM with Set Wet hair gels since they're so affordable, and to this date, they work perfectly for me and I haven't felt the need to try other expensive brands. Perfect hold and cast. WRP!  \n\n\n• Serum  \n\n\n**Livon Serum**: I have gone through so many bottles of this product and it never fails me. I apply a few drops of this serum when I scrunch out the gel cast from my hair and also on days when my hair needs a little shine and frizz control without making it look oily. WRP!\n\n&#x200B;\n\nHope this helped! Will be posting a few reviews on body care products soon! :)"
  },
  {
    "post_title": "Suggest me a sulphate shampoo for normal hair.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/10j9new/suggest_me_a_sulphate_shampoo_for_normal_hair/",
    "score": 3,
    "author": "Icy-Assignment-5327",
    "created_date": "2023-01-23 10:46:52",
    "num_comments": 7,
    "selftext": "same as the title"
  },
  {
    "post_title": "Sulphate free shampoos.",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/yhq4tu/sulphate_free_shampoos/",
    "score": 0,
    "author": "Clat-air1",
    "created_date": "2022-10-30 21:14:01",
    "num_comments": 5,
    "selftext": "Any recommendations for cheap sulphate free shampoos in the Indian market?"
  },
  {
    "post_title": "BBlunt Curly Hair Range Review (Prepoo, Shampoo, Conditioner)",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/opcp6t/bblunt_curly_hair_range_review_prepoo_shampoo/",
    "score": 38,
    "author": "mollievx",
    "created_date": "2021-07-22 12:20:06",
    "num_comments": 15,
    "selftext": "Hair Type: Thin, 2B/C Curl Patterns, Oily scalp, prone to hairfall\n\nSome hair background:\nSo I switched to using silicone and sulphate free haircare on a whim back in 2017. To my surprise, this changed my previously mostly straight hair to pretty curly. I learnt about CGM afterwards but since that seemed like a lot of effort, I just stuck to using CG friendly products and was happy with what my hair looked like. Cut to 3 months ago, when I moved to a new place with a really humid climate and my hair fall became like 10 fold. I tried going back to products that had worked for me in the past but nothing helped. Eventually, I thought, that the increased frizziness caused by humidity was the cause of the hair fall and since no product seemed to make my hair soft and silky like before, I decided to go back to silicones. A combination that helped my hair fall to some extent was Bblunt Intense Moisture Shampoo (the blue one) and Loreal Professional Serie Quinoa Protein Hair Mask (used this as conditioner after every wash). But this combination also did make my hair straighter than it had been in recent years. Decided to give the BBlunt Curly Hair range a try (the pink color one). This range does contain Silicones, so it is not strictly CG friendly but it has worked for me. I do not use any leave-in products to style my hair, but I don't mind some frizz. The curls I get from just these 3 products are pretty impressive, as good as any other CG friendly shampoo/conditioners I have used in the past. And my hair fall though still not as less as it was 6 months ago, is definitely better. Details below.\n\n1) Bblunt Curly Hair Prepoo (Pink and white tub packaging)\n\nIngredients: Aqua, Guar Hydroxypropyltrimonium Chloride, Glycerin, PEG-40 Hydrogenated Castor Oil, Phenoxyethanol, Ethylhexylglycerin, Aloe Vera Extract, Cocos (Coconut)Water, Aayla mido propyltrimonium Chloride/Acrylamide Copolymer, Citric Acid, PEG-90M, Parfum (Perfume)\n\nThoughts: Definitely my favourite of the 3. I have been looking for a  pre-shampoo product to add to my routine. Oiling and Aloeing have not worked for me. I have previously used some hair masks that said they can be used before shower but they were thick and creamy and impossible to spread properly on semi-wet or dry hair. THIS product is everything I wanted. It is a gel-like consistency, spreads super easily. I usually brush out my hair before showering and this is when I lose the most hair. Since this product claims at helping in detangling I decided to use this before I brush my hair and the hair I lost was significantly less! During and post-shower, my hair maintains great slip!  This has the potential to be HG for me. It has a pleasant coconutty smell, but the fragrances in these products do not last too long, which is nice (The loreal mask makes my hair smell like a salon even 2 days later).\n\nRepurchase Status: WRP Definitely!\n\n2) Bblunt Curly Hair Shampoo (Pink Tube)\n\nIngredients: Aqua (Water), Sodium Lauroyl Sarcosinate, Sodium Cocoyl Glycinate, Cocamidopropyl Retain, Decyl Glucoside, Bis-Aminopropyl Dimethicone, Glycol Distearate, Glycerin, Acrylates Copolymer, Cocamide MEA, Cetearyl Alcohol, Dipropylene Glycol, PEG-150 Distearate, Polysilicone-29, Guar Hydroxypropyltrimonium Chloride, Polyquaternium-7, Disodium EDTA, Sodium Hydroxide, Mica, Titanium Dioxide, Magnesium Nitrate, Methylchloroisothiazolinone, Magnesium Chloride, Methylisothiazolinone, Menthol, Cocos Nucifera (Coconut) Water, Simmondsia Chinensis (Jojoba) Seed Oil, Acetamide MEA, Hydrolyzed Keratin, Panthenol, Sorbitol, Sodium Cocoyl Collagen Amino Acid, Cocoyl Sarcosine,TriticumVulgare (Wheat) Germ Acid, Triticum Vulgare (Wheat) Germ Oil, Linolenic Acid, Linoleic Acid, Polysorbate-20, Tocopherol, Tocopheryl Acetate, Polysorbate-80, Hydrolyzed Glycosaminoglycans, Citric Acid, Sodium Chloride, Parfum (Perfume).\n\nThoughts: It is a shampoo that does its job. It cleans my oily scalp well without stripping it too much. It does not lather and spread as well as the blue BBlunt shampoo but that is to be expected as this one does not have SLS. One thing I have to mention is that near my roots this is the only product from the 3 that I used, and I noticed that the hair in that area did have some curls (usually hair close to my roots does not curl up), so this shampoo is definitely doing something right. Smells pretty fresh (like a cactus? or something softer than that lol) cant describe it. But again the smell does not linger post-shower.\n\nRepurchase Status: Maybe (I have a bunch of other shampoos lying around that I have to finish up first post-monsoon. If using any of those increases my hair fall again, will return to this)\n\n3) Bblunt Curly Hair Conditioner (Pink Tube)\n\nIngredients: Aqua, Glycerin, Cetearyl Alcohol, Amodimethicone, Behentrimonium, Methosulfate, Isopropyl Myristate, Dimethicone, Almond Oil, Polyquaternium-10, Silicone Quaternium, Polyquaternium-7, Xylitylglucoside, Anhydroxylitol, Xylitol, Cetrimonium Chloride, Acetamide MEA, Hydrolyzed Keratin, Sorbitol, Sodium Cocoyl Collagen Amino Acid, Cococoyl Satosire, Triticum Vulgare (Wheat) Germ Acid, Triticum Vulgare (Wheat) Germ Oil, Linolenic Acid, Linoleic Acid, Polysorbate 80, Polysorbate-20, Simmondsia Chinensis (Jojoba) Seed Oil, Tocopheryl Acetate, Hydrolyzed Glycosaminoglycans, Panthenol, Cocamidopropyl Betaine, Disodium EDTA, Citric Acid, Magnesium Nitrate, Methylchloroisothiazolinone, MAgnesium Chloride, Methylisothiazolinone, Trideceth-12, Laureth-23, Laureth-4, Polyglyceryl-3 Caprate, Dipropylene Glycol, Perfume\n\nThoughts: When I first used it I felt like it was super light and would not do much conditioning, but to my surprise when I rinsed it out, my hair had great slip, and detangled very easily. Some of that I will say must be because of the prepoo, but this conditioner also must be contributing. I guess since I was using the super thick loreal mask as conditioner previously, that's why this conditioner feels very light to me, but if it's doing its job, then it's ok of course. This smells like something sweet... white chocolate or marzipan. Overall I like it, and in combination with the prepoo, my hair is a lot softer than the loreal mask. \n\nRepurchase Status: Probably (again have a bunch of conditioners, i wish to use up first)\n\nI am a bit confused that even with silicones, how do these products work so well in giving me curls. Maybe I just don't know enough about how silicones work. But if with continued use I feel like silicone buildup is weighing my hair down, I can use my Fix My Curls Cleansing Shampoo once in a while, I guess."
  },
  {
    "post_title": "SLS and Paraben free Shampoo(or bars) recommendations for FINE hair + Oily Scalp!",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/ra46ra/sls_and_paraben_free_shampooor_bars/",
    "score": 2,
    "author": "ducksandjace",
    "created_date": "2021-12-06 10:23:43",
    "num_comments": 8,
    "selftext": "I've been wanting to go Sulphate and Paraben free for years now, but I have the thinnest of thin hair and the oiliest of scalps possible. I tried an SLS free shampoo 5 years ago and I probably spent half the bottle trying to get the grease off my scalp. And I'm taking without oiling my hair.\n\nWould appreciate your recommendations!\n\nP.S I'm a student! So my budget isn't that huge!"
  },
  {
    "post_title": "SHELFIE + REVIEWS + FEW 1ST IMPRESSIONS",
    "post_url": "https://www.reddit.com/r/IndianSkincareAddicts/comments/rskstv/shelfie_reviews_few_1st_impressions/",
    "score": 79,
    "author": "Distinct-Campaign425",
    "created_date": "2021-12-31 03:57:47",
    "num_comments": 44,
    "selftext": "HEY EVERYONE,\n\nHAPPY NEW YEAR !! May every day of new year brings you sweet surprises and may all ur wishes get fulfilled.\n\nThis is my first post on reddit . Hope u find this helpful n xcuse if I make any mistakes. Also a huge thanks to all the wonderful people in this community.\n\nSKIN TYPE : dry n dehydrated during winters n season change ..otherwise normal. Occasional breakout during periods.\n\nHAIR TYPE : 1a/ 1b . black .\n\nCLIMATE : extremely humid\n\nJOURNEY : So around oct 2020 I had a bad hormonal breakout . My dermat put me on accutane for a month(I had to discontinue due to some health issue) but it cleared all my breakouts n now I  was left with a lot of hyperpigmentation which took its own sweet time to fade. I discovered this sub in may last yr n this is literally the best thing that happened in 2021. A huge hug to all u guys!!\n\n&#x200B;\n\n[DEC 2020 - DEC 2021](https://preview.redd.it/lzjhxu8hts881.jpg?width=3106&format=pjpg&auto=webp&s=50945ee1b23f27991362c17d735b98077b406656)\n\nThrough this journey i have learnt one thing that like every thing else in life skincare requires patience too ..... there is no instant cure or shortcut here.\n\n&#x200B;\n\n[SHELFIE](https://preview.redd.it/ap4uzu3nts881.jpg?width=3264&format=pjpg&auto=webp&s=ab37cc4c4234bf57630324fa0ffe3fb986f4bca8)\n\n&#x200B;\n\n>***REVIEWS***\n\n*keywords:* HG- holy grail, WRP-will repurchase, WNRP-will not repurchase\n\n*Rating:* 1/5-disliked the product , 2/5-not impressed , 3/5-nice but can find better products , 4/5-really enjoyed , 5/5-HG loved everything about it\n\n**CLEANSER**\n\n1. **EPISOFT CLEANSING LOTION-** my dermat recommended this. Mild cleanser. Not sufficient to remove sunscreen . *WNRP* due to price point.**(2/5)**\n2. **CLEANSEME CLEANSING LOTION-** Again nice n mild. inexpensive. perfect for winters. *WRP*. **(4/5)**\n3. **VLCC HALDI CLEANSER-** Inexpensive n easily available. Has a gel texture n foams up pretty well . cleanses nicely without drying . *Might RP.***(3/5)**\n4. **DERMA ESSENTIA CLEANSING LOTION-** This doesnot clean properly way too mild . *WNRP.* **(1/5)**\n5. **BIODERMA ATODERM CLEANSER-** The quantity is great n pricepoint is good too. will probably last me a whole year. Has a runny texture , foams up pretty well , cleanses without drying n face feels cleans. *WRP* definately but I dont know if this is HG.  (i have stored this in derma essentia bottle cuz the cap broke). **(4/5)**\n\n**MOISTURIZER**\n\n1. **CETAPHIL DAM LOTION-** finished 3 bottles . This was my HG before I found bioderma n minimalist. Has a light texture , gets absorbed easily but this doesnt have the nourishing, emolient feel which my HG gives. The price point is good .*WNRP* cuz I found better products. **(3/5)**\n2. **BIODERMA ATODERM BAUME-** this legit saved my dry ass skin last mnth. The texture is thick n nourishing but this makes me look like a greaseball . i use it at night so the greasyness is not an issue. This has made my skin healthy. *WRP every winter* **HG.(5/5)**\n3. **MINIMALIST SEPICALM-** This is sooooo gooood. The texture is super light but it is very nourishing n has that emollient feeling which my skin loves. This will be perfect for summer nights n winter morning. I hope they make 200ml bottles .*WRP for summers* **HG.(5/5)**\n4. **MINIMALIST SQUALANE OIL-** this is very light yet occlusive . I mix this with bioderma or minimalist whichever I feel like using. last week when i got few cystic acne I used cosrx snail followed by bioderma + squalane , this combo calmed my skin n helped with the acne too. I haven't used any other oil so can't compare but this is nice . *might RP* if needed in winters. **(4/5)**\n5. **JOHNSON BABY LOTION-** Got this from supermarket. I hate the smell too sweet for my liking. The texture is light, gets absorbed quickly. I am using this on my body to finish it up . *WNRP.***(1/5)**\n6. **AVEENO LOTION-** The texture of this is super weird. When used initially it feels very hydrating but later gives a very silicony feel . Not nourishing or calming at all. *WNRP.***(1/5)**\n\n**SUNSCREEN**\n\n1. **EPISOFT AC  SPF30-** Was recommended by dermat. Feels like a light moisturizer but nourishing. This makes my skin greasy also not sweat resistant . Can be fine to use at home. *WNRP* cuz not sweat resistant n not very affordable too.**(2/5)**\n2. **BELLO PHOTOSTABLE SPF40-** moisturizing but not very heavy . Gives a slight greasy finish (can be fixed with a powder). has a curd like texture  . not sweat n water resistant. pricepoint is good. *Might RP for winters.***(4/5)**\n\n**TREATMENT**\n\n1. **MINIMALIST 5% NIACINAMIDE SERUM-** got this after hearing all the praises about niacinamide. this actually dried out my skin no matter how i used this. I didn't see any change . i'll try more niacinamide products in the future.  WNRP.**(1/5)**\n2. **DECONSTRUCT 5% LACTIC ACID SERUM-** My 1st chemical exfoliant. I got this for dullness , pih n mild acne. I am happy to report this worked wonderfully , didnot cause any sensitivity n gave me nice glowy uncongested skin. *HOWEVER WNRP* coz i'd like to try korean exfoliating toners as they are cheaper.**(4/5)**\n3. **MELAGLOW RICH BY ABOTT-** Prescribed by dermat. This was the only treatment I used regularly last yr. My PIH reduced due to this but it took a lot of time(as expected). *WRP* if needed in future.**(5/5)**\n\n**HAIRCARE**\n\n1. **SAFA BLACK SEED OIL-** Have been using since 2 mnths . I use it a night before my washing day. haven't seen a lot of diff but in such short time I don't expect any. I'll review it later on ... maybe next yr. *WRP maybe.***(4/5)**\n2. **REEQUIL MURUMURU CONDITIONER-** honestly I dont know how I feel about this. This is my 1st silicone free conditioner. Feels nourishing n nice but it doesn't do much . My hair is managable even without it. *WNRP* I'll try other conditioners to compare i guess.**(3/5)**\n3. **REEQUIL ANTI DANDRUFF SHAMPOO-** This is very drying . My brother tried it n said the same. i have mild dandruff n haven't seen any diff. *WNRP .***(1/5)**\n4. **RUSTIC ART AMLA SHIKAKAI SHAMPOO BAR-** doesn't clean the scalp properly however this conditions the hair very well. *WNRP* i dont know how to finish these shampoos.**(1/5)**\n5. **HEAD N SHOULDER SHAMPOO(NOT IN PIC)-** This is the common family shampoo n the only one which works for my hair. I have figured out that sulphate free shampoo don't work for me so ill continue with sulphate shampoos fron here on. *WRP*  coz inexpensive n ill try other sulphate shampoo.**(4/5)**\n\n**BODYCARE**\n\n1. **NIVEA SCRUB-** Got this for my body . this has those plastic microbeads which r not good for the environment. WNRP doesn't even scrub properly.**(1/5)**\n2. **HIMALAYA WALNUT SCRUB-** This is way too harsh even for body. I have the entire bottle lying.. god knows how i'm gonna finish this. *WNRP.***(1/5)**\n3. **NEUTROGENA SALICYLIC CLEANSER-** I used this on my underarms(for odour n pigmentation) n arms(for KP) mostly. Does clean properly , can be a little drying but controls body odour n helped with KP too. I use to use this on face whenever it felt congested, worked just fine but again a little drying. *WNRP* as i'll try other cheaper exfoliating washes.**(3/5)**\n4. **FIAMA LAVENDAR BODY WASH(NOT IN PIC)-** this is common family product. Inexpensive , cleans properly n smell is good too. My mom *WRP.***(3/5)**\n5. **NIVEA BODY LOTION-** This has alchohol and does dry out skin instead of moisturizing it. *WNRP.***(2/5)**\n6. **VASELINE DERMA BODY LOTION-** I loved this . Used this last winters . Was moisturizing but i think i'll need smthing thicker for winter. *Might RP* .**(4/5)**\n\n**LIP BALM**\n\n1. **VASELINE-** OG product , allrounder, *WRP.***(5/5)**\n2. **BOROLINE-** This heals my lips overnight like magic. Love this. *HG WRP.***(5/5)**\n3. **NIVEA LIP BALM-** This is thick occlusive but very uncomfortable. *WNRP*.**(2/5)**\n4. **KHADI NATURALS LYCHEE HERBAL LIP BALM-** The texture is medium to thick . Wasn't repairing or moisturizing. Smell was sweet. *WNRP.***(1/5)**\n\n&#x200B;\n\n&#x200B;\n\n>***NEW PRODUCTS- 1ST IMPRESSION***\n\n&#x200B;\n\nhttps://preview.redd.it/csccmnmtts881.jpg?width=942&format=pjpg&auto=webp&s=170a84a14e18ba7dcb4464f417d444162d4f12d9\n\n&#x200B;\n\n1. **COSRX SNAIL MUCIN-** Been using since 2 weeks in PM routine. Hydrates n calms skin like magic . Don't know if I can say HG , will give a verdict when I finish the bottle but till then definatey a good addition to my routine.\n2. **LOVE BEAUTY N PLANET COCONUT WATER LOTION-** used this 4 times . very light , gets absorbed in seconds n not moisturizing enough for winters.... will be nice in summers i guess. The smell is like the old dove body lotion I use to use in my childhood. i can say I WNRP.\n3. **GLOBUS NATURALS AHA N BHA FACE WASH-** This again has microbeads. I don't know if this works (yet) but if this does then i don't knw if i'll RP (due to the beads) .Foams up fine. texture is clear gel like.\n4. **MINIMALIST SALICYLIC ACID+ LHA CLEANSER-**  Used this once on my face . got rid of congestion but wasn't drying at all . Can' t give a verdict but so far so good.\n\n&#x200B;\n\nThat's it for today . BYE ADIOS!!"
  }
]